{
  "id": "calcutta-high-court-reinforces-change-of-opinion-bar-a-landmark-ruling-for-reassessment-proceedings-1765932776456",
  "title": "Calcutta High Court Reinforces 'Change of Opinion' Bar: A Landmark Ruling for Reassessment Proceedings",
  "slug": "calcutta-high-court-reinforces-change-of-opinion-bar-a-landmark-ruling-for-reassessment-proceedings",
  "date": "17 December 2025",
  "content": "# Calcutta High Court Reinforces 'Change of Opinion' Bar: A Landmark Ruling for Reassessment Proceedings\n\nAs tax professionals, we often grapple with the spectre of reassessment notices under the Income Tax Act, 1961. It's a tricky wicket, isn't it? The Assessing Officer (AO) has wide powers to reopen assessments if they believe income has escaped taxation. But where do we draw the line between a genuine case of income escapement and a mere re-evaluation of already examined material? This is where the venerable \"change of opinion\" doctrine steps in, acting as a crucial safeguard for taxpayers. And recently, the Calcutta High Court has, once again, firmly upheld this doctrine, delivering a significant judgment on **December 8, 2025**, that will surely resonate across the tax fraternity.\n\nThis ruling is a powerful reminder that an Assessing Officer cannot simply revisit an issue, on which a view was already formed during the original assessment, just because they now hold a different perspective. *Nahin chalega, boss!*\n\n## Decoding Reassessment & The 'Change of Opinion' Doctrine\n\nLet's quickly refresh our understanding of the legal landscape. The Income Tax Act, 1961, particularly **Section 147** read with **Sections 148** and **148A**, empowers the Income Tax Department to initiate reassessment proceedings. Post the Finance Act, 2021 amendments, the emphasis shifted from \"reason to believe\" to \"information which suggests that income chargeable to tax has escaped assessment.\" This \"information\" could be based on various sources, including audit objections, search operations, or data from other government agencies.\n\nHowever, a fundamental principle, consistently reinforced by the judiciary, is that reassessment cannot be a guise for a mere **\"change of opinion.\"** What does this actually mean? Simply put, if the Assessing Officer has, during the original assessment (or even an earlier reassessment process), applied their mind to a particular issue, considered the relevant material, and formed an opinion, they cannot subsequently reopen the assessment on the very same facts or material just because a different view is now taken. This would amount to a \"review\" of the original assessment, a power that the AO does not possess under the reassessment provisions.\n\nThe Supreme Court, in its seminal judgment in **Commissioner of Income Tax, Delhi v. Kelvinator of India Ltd. (2010)**, clearly distinguished between the power to review and the power to reassess, asserting that reassessment must be based on the fulfillment of certain preconditions, and not merely a change of opinion. If the concept of \"change of opinion\" is removed, it would lead to a review being undertaken in the garb of reopening the assessment, which is impermissible.\n\n## The Himadri Speciality Chemical Case: A Detailed Analysis\n\nThis brings us to the recent, critical judgment by the Calcutta High Court.\n\n### Facts of the Case\nThe case of **Himadri Speciality Chemical Limited (formerly known as Himadri Chemicals & Industries Ltd.) v. Assistant/Deputy Commissioner of Income Tax, Central Circle 3(4) & Ors.** involved a challenge to a reassessment notice issued under Section 148 of the Income Tax Act, 1961, for the Assessment Year (AY) 2019-20.\n\nThe origin of the dispute lay in a search and survey operation conducted at the premises of the company's transporter, Liquid Gold Carriers Private Limited. Based on the material gathered, the Income Tax Department alleged that Himadri Speciality Chemical had received an unaccounted cash return of ₹80,62,000 from the transporter against bogus transportation bills.\n\nHere's the crucial twist: The very same alleged cash return amount for AY 2019-20 had already been raised and examined by the *same Assessing Officer* during the earlier reassessment of the transporter's income. In that earlier proceeding, a notice under **Section 133(6)** of the Income Tax Act, 1961, was issued to Himadri Speciality Chemical, to which the company had categorically denied receiving any such cash return. Importantly, the transporter's assessment was subsequently completed on August 26, 2022, and the AO *did not make any addition* on account of the alleged cash return, thereby implicitly accepting the submissions made by both parties.\n\nDespite this prior examination and tacit acceptance, the Income Tax Department proceeded to initiate fresh reassessment proceedings against Himadri Speciality Chemical on the *identical issue*, based on the *same material*.\n\n### The Taxpayer's Stance\nHimadri Speciality Chemical Limited contended that the initiation of fresh reassessment proceedings on an issue already examined and accepted by the same AO constituted an impermissible **\"change of opinion.\"** The company argued that once the AO had applied their mind to the facts and material and chosen not to make an addition, reopening the case on the same grounds amounted to a review, not a reassessment based on new, tangible information.\n\n### Calcutta High Court's Decision\nPresiding over the matter, **Justice Om Narayan Rai** of the Calcutta High Court delivered a decisive judgment on **December 8, 2025**. The Court meticulously observed that the identical issue had indeed been raised and examined by the same Assessing Officer during the transporter's reassessment for AY 2019-20. The AO, at that time, had all the relevant information and had implicitly accepted the assessee's and the transporter's versions by not making any addition.\n\nJustice Rai emphatically ruled that initiating fresh reassessment proceedings on the same issue, based on material already available and considered, amounted to an impermissible \"change of opinion\" by the Assessing Officer. The Court highlighted that such an action constituted a \"wrong assumption of jurisdiction\" by the AO, as the reopening was based on a review of existing material rather than any fresh tangible evidence suggesting escapement of income.\n\nConsequently, the Calcutta High Court set aside the order passed under **Section 148A(3)** dated June 26, 2025, along with the consequential notice issued under Section 148 of the Income Tax Act, 1961.\n\n## Key Takeaways for Tax Professionals\n\nThis judgment is a breath of fresh air and offers several critical lessons for us as tax professionals:\n\n*   **Vigilance is Key:** Always be meticulous in preparing and filing responses to any notices from the Income Tax Department, especially under **Section 133(6)** or during any assessment/reassessment proceedings. The records of what was submitted and considered are paramount.\n*   **Document Everything:** Ensure that all submissions, clarifications, and acknowledgments during assessment proceedings are well-documented. This evidence becomes your shield against any subsequent attempts at reassessment based on a change of opinion.\n*   **Understand AO's Limitations:** While the AO has significant powers, these powers are not unfettered. The \"change of opinion\" doctrine is a vital check on arbitrary reopening of assessments.\n*   **The Law Remains Constant:** Despite amendments to reassessment provisions (like the shift from 'reason to believe' to 'information'), the underlying judicial principle against 'change of opinion' remains robust. *Yeh rule abhi bhi applicable hai, aur strong hai!*\n*   **Challenge Invalid Reassessments:** If a reassessment notice is clearly based on a mere change of opinion on issues already examined, it warrants a strong challenge, potentially through a writ petition, as demonstrated by the Himadri case.\n\n## Concluding Thoughts\n\nThe Calcutta High Court's judgment in the Himadri Speciality Chemical case serves as a powerful affirmation of a long-standing and crucial legal principle. It reiterates that the Assessing Officer's power to reassess is not a power to review their own prior decisions or opinions formed on the same material. For the integrity of the assessment process and to prevent endless litigation, it is imperative that reassessments are initiated only when there is genuine \"information\" leading to the belief of income escapement, and not merely a re-thinking of facts already on record. This ruling brings much-needed clarity and confidence to taxpayers and their advisors.\n\n## Read the Official Document\n* [Visit the Calcutta High Court's Official Judgments Section](https://www.calcuttahighcourt.gov.in/Orders-Judgment)\n\n*Published on: 17 December 2025*",
  "type": "blog"
}