{
  "id": "gaar-and-dtaa-benefits-supreme-court-delivers-landmark-clarity-on-indirect-transfers-1769084861678",
  "title": "GAAR and DTAA Benefits: Supreme Court Delivers Landmark Clarity on Indirect Transfers",
  "slug": "gaar-and-dtaa-benefits-supreme-court-delivers-landmark-clarity-on-indirect-transfers",
  "date": "22 January 2026",
  "content": "# GAAR and DTAA Benefits: Supreme Court Delivers Landmark Clarity on Indirect Transfers\n\nNamaste, esteemed colleagues!\n\nThe tax landscape, as we all know, is a dynamic beast. Just when you think you've got a handle on the intricacies, a new judgment comes along that resets the playing field. And what a judgment it has been! The Supreme Court of India, in its much-anticipated decision dated January 15, 2026, has finally shed considerable light on the vexed interplay between the **General Anti-Avoidance Rule (GAAR)** and **Double Taxation Avoidance Agreement (DTAA)** benefits, particularly concerning **indirect transfers**. This is one of those rulings that will have us all poring over our existing structures, thinking, \"Achcha, so *yeh rule* ab applicable hai?\"\n\nFor a long time, the tax fraternity, especially those dealing with cross-border investments and M&A, has grappled with the uncertainty surrounding GAAR's supremacy over DTAA provisions. The big question has always been: can a taxpayer claim treaty benefits even if the primary intent of an arrangement appears to be tax avoidance? And how does this impact those 'legacy' indirect transfer structures? The Supreme Court's decision, especially in the context of the highly watched \"Tiger Global-Flipkart\" case, has provided much-needed clarity, reinforcing India's commitment to substance over form.\n\n## Understanding the Conundrum: GAAR, DTAA, and Indirect Transfers\n\nBefore we dive into the nitty-gritty of the judgment, let's quickly recap the key players here:\n\n*   **General Anti-Avoidance Rule (GAAR):** Introduced in Chapter X-A (Sections 95 to 102) of the Income-tax Act, 1961, effective April 1, 2017, GAAR is India's statutory weapon against aggressive tax planning. Its objective is to deny tax benefits arising from arrangements primarily designed for tax avoidance, giving primacy to economic substance over legal form. An arrangement is termed an **Impermissible Avoidance Arrangement (IAA)** if its main purpose is to obtain a tax benefit and it satisfies certain 'tainted elements,' such as lacking commercial substance.\n*   **Double Taxation Avoidance Agreements (DTAAs):** These bilateral agreements between India and other countries aim to prevent taxpayers from being taxed twice on the same income. Traditionally, Section 90(2) of the Income-tax Act allowed taxpayers to choose the more beneficial provisions between the Act and a DTAA. However, with the introduction of GAAR, Section 90(2A) was inserted, clarifying that GAAR provisions would apply even if they override DTAA benefits.\n*   **Indirect Transfers:** The concept of indirect transfer taxation in India gained prominence with the retrospective amendment to Section 9(1)(i) of the Income-tax Act in 2012, inserting Explanations 4 and 5. This amendment clarifies that income arising from the transfer of shares or interests in a foreign company or entity that substantially derives its value from assets located in India is deemed to accrue or arise in India and is, therefore, taxable.\n\nThe fundamental tension lay in whether GAAR could 'look through' a DTAA-protected structure, especially when indirect transfers were involved, and particularly for investments made prior to GAAR's effective date but exited thereafter.\n\n## The Supreme Court's Decisive Pronouncement (Judgment dated January 15, 2026)\n\nThe recent Supreme Court judgment effectively settles this long-standing debate. Let's break down the key aspects of the decision.\n\n### Factual Matrix (The Tiger Global-Flipkart Case)\n\nThe case involved the sale of shares of Flipkart Singapore by certain Mauritius-based entities (part of Tiger Global International III Holdings) to a Luxembourg entity, as part of the larger Walmart-Flipkart acquisition in 2018. The Mauritius entities had acquired these shares between 2011 and 2015, *before* April 1, 2017. They sought to claim exemption from capital gains tax in India under the India-Mauritius DTAA, relying on a Tax Residency Certificate (TRC) and the 'grandfathering' provisions under Article 13(3A) of the DTAA (for investments before April 1, 2017).\n\nThe Indian Revenue Authority (IRA) challenged this, contending that the Mauritius entities were conduit/shell entities lacking commercial substance, and the arrangement was primarily for tax avoidance, thus triggering GAAR principles. The Authority for Advance Rulings (AAR) had initially sided with the Revenue, but the Delhi High Court had set aside the AAR's decision. The matter then reached the Supreme Court.\n\n### Legal Provisions at Play\n\nThe Supreme Court meticulously analyzed several provisions:\n\n*   **Chapter X-A of the Income-tax Act, 1961 (GAAR):** Specifically, Sections 95 (applicability of GAAR), 96 (impermissible avoidance arrangement), and 97 (lack of commercial substance).\n*   **Section 9(1)(i) with Explanations 4 and 5:** Dealing with income deemed to accrue or arise in India, particularly for indirect transfers.\n*   **Section 90(2) and 90(2A):** The 'treaty override' provision and the explicit carve-out for GAAR.\n*   **India-Mauritius DTAA:** Particularly Article 13 (Capital Gains) and Article 27A (anti-abuse provisions, though the focus was more on the general GAAR override).\n*   **Rule 10U of Income-tax Rules, 1962:** Which provides for grandfathering but was interpreted in the light of GAAR.\n\n### The Court's Unambiguous Decision\n\nThe Honourable Supreme Court, upholding the AAR's decision and setting aside the Delhi High Court's order, delivered a definitive ruling with far-reaching implications:\n\n1.  **GAAR Overrides DTAA in Abuse Cases:** The Court emphatically stated that GAAR provisions would override DTAA benefits where the arrangement constitutes an **Impermissible Avoidance Arrangement (IAA)**. The intent behind GAAR is to ensure that while legitimate tax planning is allowed, structures lacking commercial substance, designed purely for tax benefits, cannot hide behind treaty provisions.\n2.  **TRC Not Conclusive Proof:** A **Tax Residency Certificate (TRC)**, while necessary, is not sufficient or conclusive evidence for claiming DTAA benefits if the underlying arrangement lacks commercial substance. The Court emphasized a \"substance over form\" approach, looking beyond mere legal compliance to the commercial reality of the transaction. If the actual control and decision-making happen outside the claimed country of residence, the treaty entitlement fails.\n3.  **Grandfathering Limited for Indirect Transfers (in abusive scenarios):** This is a critical clarification. The Court held that the grandfathering provisions under Article 13(3A) of the India-Mauritius DTAA, which protected investments made before April 1, 2017, **do not grant blanket immunity** to abusive structures, especially in indirect transfers. It clarified that Article 13(3A) applies primarily to *direct* transfers of Indian shares. Indirect transfers, where the value is derived substantially from Indian assets, fall under the residuary Article 13(4) of the IM DTAA. This means that even if an investment was made pre-2017, if the *arrangement* giving rise to the tax benefit post-April 1, 2017, is found to be an IAA, GAAR can be invoked.\n4.  **Burden of Proof on the Taxpayer:** Once the Revenue establishes a *prima facie* case that an arrangement is an IAA (i.e., designed for tax benefit and lacking commercial substance), the **onus shifts to the assessee** to prove the bona fide commercial purpose of the arrangement. Mere incorporation or formal compliance is insufficient.\n5.  **AAR's Role in Screening:** The Supreme Court reaffirmed the Authority for Advance Rulings' duty to screen out tax-avoidance applications at the threshold. If an arrangement is *prima facie* designed for tax avoidance, the AAR is statutorily barred from entertaining the application.\n6.  **CBDT Circulars (Pre-GAAR) vs. GAAR:** The Court observed that circulars issued by the CBDT before GAAR's introduction would not hold good in a post-GAAR environment if they conflict with the anti-avoidance principles.\n\n## What Does This Mean for You and Your Clients?\n\nThis judgment is a significant milestone, reinforcing India's robust anti-avoidance framework. \"Sir, ab toh clear ho gaya,\" one might say. Here are some key takeaways:\n\n*   **Substance Over Form is King:** The era of relying solely on legal form and treaty phraseology without demonstrable economic substance is over, if it ever truly existed. Any cross-border structure, particularly those involving intermediary holding companies, will face heightened scrutiny. You need to show genuine commercial rationale for your arrangements.\n*   **TRCs are Evidentiary, Not Protective:** While you still need a valid TRC, it's no longer a bulletproof vest against anti-avoidance measures. Be prepared to substantiate the commercial activities, management control, and operational presence in the treaty country.\n*   **Indirect Transfers Under the Lens:** For indirect transfers, even if the underlying investment predates GAAR's effective date, the *arrangement* for transfer and exit benefits will be rigorously examined. Grandfathering provisions, especially under the India-Mauritius DTAA, will not automatically shield arrangements deemed abusive.\n*   **Documentation is Paramount:** To discharge the burden of proof, comprehensive documentation demonstrating the commercial purpose, business risks, and cash flows (apart from tax benefits) is crucial.\n*   **Advance Rulings and GAAR:** If there's even a *prima facie* suggestion of tax avoidance, securing an advance ruling might become challenging. Taxpayers will need to be extremely confident about the commercial merits of their arrangements.\n*   **Constant Review of Structures:** This judgment necessitates a fresh look at existing and proposed investment structures. If your client has layered offshore structures primarily for tax minimization, it's high time for a comprehensive review.\n\nIn essence, the Supreme Court has sent a clear message: while the government welcomes foreign investment, it will not tolerate arrangements designed to exploit loopholes for tax avoidance. The focus will firmly remain on genuine economic activity and commercial substance. As tax professionals, our role in guiding clients towards compliant and sustainable structures has become even more critical.\n\n## Read the Official Document\n\n*   [Visit the Official Website of the Supreme Court of India](https://main.sci.gov.in/)\n\n*Published on: 22 January 2026*",
  "type": "blog"
}