{
  "id": "ibbi-proposes-major-reforms-to-enhance-transparency-and-safeguards-in-cirp-a-deep-dive",
  "title": "IBBI Proposes Major Reforms to Enhance Transparency and Safeguards in CIRP: A Deep Dive",
  "date": "November 20, 2025",
  "content": "# IBBI Proposes Major Reforms to Enhance Transparency and Safeguards in CIRP: A Deep Dive\n\nThe Corporate Insolvency Resolution Process (CIRP) under India's Insolvency and Bankruptcy Code (IBC) has continuously evolved since its inception, aiming to facilitate timely resolution and value maximization for distressed companies. In a significant move to further strengthen the framework, the Insolvency and Bankruptcy Board of India (IBBI) has recently unveiled a comprehensive Discussion Paper dated November 17, 2025, proposing landmark reforms to enhance transparency, accountability, and safeguards within the CIRP. These proposals aim to address systemic gaps identified through judicial pronouncements, real-world implementation experiences, and persistent stakeholder concerns, particularly focusing on disclosure enhancement, improved protection for allottees, and fortified oversight in Committee of Creditors (CoC) functioning.\n\n### Automatic Inclusion and Protection for Allottees (Homebuyers)\n\nOne of the most crucial reforms addresses the recurring challenges faced by homebuyers (allottees) in real estate insolvencies. Currently, the Information Memorandum (IM) often reflects only those claims formally submitted, potentially excluding genuine allottees whose details are present in the corporate debtor's books but who may have missed the claim-filing deadline. This gap often leads to significant hardship, delays, and avoidable litigation during the resolution plan's implementation phase, as non-filing homebuyers subsequently seek recognition.\n\n**The Proposed Solution:** The IBBI now proposes to amend Regulation 36(2) and insert Regulation 38A, mandating that the Information Memorandum must explicitly include details of *all* allottees—their names, amounts due, and units allotted—as reflected in the corporate debtor's books of accounts, irrespective of whether they have filed a formal claim. Furthermore, any resolution plan must strictly provide for the treatment of such non-filing allottees. This significant change, prompted by judicial observations highlighting \"inequitable and unfair resolution\" caused by such exclusions, promises to ensure equitable treatment and prevent last-minute hurdles, thereby enhancing clarity and fairness for all genuine homebuyers.\n\n### Broadening the Scope of the Information Memorandum\n\nTo provide a more accurate and comprehensive picture of the corporate debtor's assets, the IBBI has proposed substantial enhancements to the disclosure requirements within the Information Memorandum. The existing framework sometimes fell short in presenting a \"true and fair\" view of all assets, impacting prospective resolution applicants' ability to formulate robust plans.\n\n**The Proposed Solution:** The Discussion Paper suggests that the IM must explicitly include detailed information regarding:\n*   **Receivables:** This includes trade, inter-corporate, and contractual receivables.\n*   **Rights under Joint Development Agreements (JDAs):** Recognizing these rights as valuable property, their disclosure will ensure they are appropriately considered in the resolution process.\n*   **Assets under Attachment:** Details of assets attached by enforcement agencies like the Enforcement Directorate (ED) or the Income Tax Department, along with the current status of such proceedings, will also be mandatory.\n\nThis enhanced disclosure is critical for reducing information asymmetry, enabling resolution professionals and potential bidders to make more informed decisions, and ultimately contributing to better value maximization for the corporate debtor's assets.\n\n### Strengthening CoC Integrity in Specific Scenarios\n\nThe CoC plays a pivotal role in the CIRP, making critical decisions regarding the company's future. The IBBI has identified a systemic gap where the Committee of Creditors may lack representation from regulated financial institutions, and a single unregulated financial creditor holds a dominant voting share (exceeding 66%). In such situations, the absence of the typical rigour and discipline associated with institutional lenders can raise concerns about the integrity of decision-making.\n\n**The Proposed Solution:** To safeguard the decision-making process, a new Regulation 16E is proposed. This aims to introduce checks and balances, potentially through observer participation, in cases where no financial institution is present in the CoC and a single unregulated creditor holds more than 66% voting power. This move is intended to ensure that all decisions are made with due diligence and transparency, upholding the spirit of the IBC.\n\n### Mandatory Rationale for Liquidation Decisions\n\nInstances have been observed where the Committee of Creditors has recommended liquidation despite receiving compliant and viable resolution plans, sometimes even with a value exceeding the liquidation value of the corporate debtor's assets. Often, the minutes of CoC meetings in such cases do not adequately record the rationale behind these decisions, leading to a lack of accountability and transparency.\n\n**The Proposed Solution:** The IBBI proposes to make it mandatory for the CoC to record detailed reasons for recommending liquidation, especially when a resolution plan of value greater than the liquidation value has been received. These reasons must be furnished along with the liquidation application, ensuring greater transparency and accountability in such critical decisions. This reform aims to prevent arbitrary liquidation and reinforce the primary objective of the CIRP, which is resolution over liquidation.\n\n### Broader Implications and Way Forward\n\nThese proposed reforms underscore the IBBI's commitment to proactively refine the insolvency framework, address practical challenges, and align the CIRP more closely with judicial expectations and stakeholder realities. If implemented, these measures are expected to significantly reduce litigation, ensure fairness across different classes of creditors (especially homebuyers), and enhance the overall credibility, efficiency, and predictability of India's insolvency ecosystem. The IBBI has invited public comments on these proposals, signaling a collaborative approach to strengthening the IBC framework.\n\nIt's also worth noting that these proposals build upon earlier amendments aimed at improving transparency, such as those effective July 4, 2025, which mandated comprehensive disclosure and treatment of avoidance transactions in the IM, and earlier regulations from February 2024 that introduced monthly CoC meetings, explained valuation methodologies to CoC members, and allowed for monitoring committees in real estate projects.\n\nThe latest Discussion Paper marks a pivotal moment, aiming to create a more robust, accountable, and litigation-resistant insolvency regime in India.",
  "created_at": "2025-11-20T13:39:35.449Z"
}
