{
  "id": "no-customs-duty-on-seztodta-electricity-supreme-court-clarifies-position-bolsters-sez-ecosystem-1768265696605",
  "title": "No Customs Duty on SEZ-to-DTA Electricity: Supreme Court Clarifies Position, Bolsters SEZ Ecosystem",
  "slug": "no-customs-duty-on-seztodta-electricity-supreme-court-clarifies-position-bolsters-sez-ecosystem",
  "date": "13 January 2026",
  "content": "# No Customs Duty on SEZ-to-DTA Electricity: Supreme Court Clarifies Position, Bolsters SEZ Ecosystem\n\nAs Indian Chartered Accountants and Legal Analysts, we often grapple with the nuances of tax laws, especially when it comes to the complex interplay between Special Economic Zones (SEZs) and the Domestic Tariff Area (DTA). The recent Supreme Court judgment, delivered on January 5, 2026, in the case of **Adani Power Limited & Anr. v. Union of India & Ors.** (Neutral Citation: 2026 INSC 1), brings much-needed clarity and a sigh of relief for power producers operating within SEZs. This landmark ruling unequivocally states that **customs duty cannot be levied on electricity supplied from an SEZ to the DTA**.\n\nYeh decision, no doubt, is a significant one. It not only provides financial restitution to the appellant, Adani Power, but also reaffirms foundational principles of taxation, judicial discipline, and the limits of delegated legislation. Let’s dive deeper into what this means for businesses and the overall SEZ framework.\n\n## The Conundrum: Electricity from SEZ – Import or Not?\n\nFor years, the question of whether electricity generated within an SEZ and supplied to the DTA should attract customs duty has been a point of contention. On one hand, SEZs are treated as foreign territory for fiscal purposes to promote exports. On the other, electricity generated within India, even if within an SEZ, technically isn't \"imported\" into India when supplied to the DTA. This grey area led to significant litigation and uncertainty.\n\nHistorically, imported electrical energy attracted a nil rate of customs duty. Consequently, electricity supplied from an SEZ to the DTA also did not suffer any independent customs duty. Instead, Rule 47(3) of the SEZ Rules, 2006, often ensured that the customs duty benefit on duty-free inputs used for power generation was neutralized when electricity was supplied to the DTA.\n\nHowever, the Union Government, through a series of notifications starting with **Notification No. 25/2010-Cus.**, attempted to impose customs duty on electricity cleared from SEZs to the DTA. These notifications, at times, sought to levy duty retrospectively, creating a huge burden for SEZ units.\n\n## The Long Battle: From Gujarat High Court to the Apex Court\n\nThe saga is quite telling. Adani Power Limited, operating a thermal power plant within the Mundra SEZ, found itself at the heart of this dispute. When the government imposed customs duty, they challenged it.\n\nIn 2015, the Gujarat High Court had initially provided relief, striking down the 16% ad valorem levy as ultra vires. The court then had held that electricity generated within India and supplied from an SEZ to the DTA does not constitute an \"import into India,\" and that exemption notifications cannot be used to create a tax. This decision attained finality when the Supreme Court declined to interfere with it.\n\nDespite this clear pronouncement, the Union continued to seek customs duty for subsequent periods under later notifications. When Adani Power sought enforcement of the 2015 judgment for these later periods, the Gujarat High Court, in a 2019 judgment, denied relief, reasoning that the later notifications were not specifically challenged. This is where the Supreme Court stepped in, setting aside the 2019 Gujarat High Court judgment.\n\n## Supreme Court's Resounding Verdict: No Statutory Backing for the Levy\n\nA Bench comprising Justices Aravind Kumar and N.V. Anjaria delivered the powerful judgment on January 5, 2026. Their decision rested on several critical legal pillars:\n\n*   **Absence of Charging Provision:** The core of the ruling is that there is **no charging provision under Section 12 of the Customs Act, 1962,** to impose customs duty on electricity supplied from an SEZ to the DTA. For a tax to be levied, there must be clear statutory authority, and in this case, it was missing. As the Court rightly pointed out, electricity generated within India and supplied domestically from an SEZ does not qualify as \"imported goods\".\n*   **\"As if Imported\" is not a Charging Event:** Section 30 of the SEZ Act, 2005, states that goods removed from an SEZ to the DTA are chargeable to customs duties \"as if such goods had been imported into India.\" The Supreme Court clarified that this phrase is merely a **parity clause**. It is intended to align the rate of duty with comparable foreign imports, not to create a fresh charging event or expand the scope of Section 12 of the Customs Act. When imported electricity attracts nil customs duty, then electricity supplied from an SEZ to DTA must equally attract nil customs duty.\n*   **Misuse of Exemption Power:** The Court emphasized that **Section 25 of the Customs Act, 1962, empowers the government only to grant exemptions from an existing levy, not to create a new duty**. The executive cannot, through delegated legislation or exemption notifications, enlarge the field of taxation that Parliament has not imposed. This was a \"colourable exercise of power.\"\n*   **Judicial Discipline and Precedent:** The Supreme Court strongly reiterated the principle of *stare decisis* – adhering to settled law. It held that once a levy has been declared to be without authority of law, a constitutional court cannot remain a silent spectator while the same levy is sought to be continued through successive or similar notifications. The law, after all, cannot change with the change of the Bench.\n*   **Restitution is Key:** Since the levy was without authority of law, the State cannot retain the amount collected under such an invalid tax. Restitution is a necessary outcome of finding illegality.\n\n## Impact and Key Takeaways for Businesses\n\nThe implications of this judgment are far-reaching, especially for businesses operating or planning to operate within SEZs:\n\n*   **Clarity and Certainty:** This ruling provides much-needed **tax certainty** for SEZ power producers. The cloud of ambiguity around customs duty on SEZ-to-DTA electricity supply has finally been cleared.\n*   **Refunds for Affected Parties:** The Supreme Court has directed the Union of India to **refund the duties collected from Adani Power for the period between September 16, 2010, and February 15, 2016**, to be processed within eight weeks, though without interest. This opens the door for other similarly situated SEZ units to seek refunds if they have paid such duties.\n*   **Limits on Executive Power:** The judgment serves as a strong reminder to the executive that taxation must always be grounded in clear statutory authority. Delegated legislation cannot be used to impose taxes indirectly where no charging provision exists.\n*   **Strengthening SEZ Policy:** By removing an unwarranted tax burden, this decision reinforces the original intent of SEZ policy – to encourage production and exports by providing a favourable fiscal regime. It ensures that SEZ units are not subjected to arbitrary or illegal levies.\n\nThis is a significant win for constitutional principles and a clear message that *manmarzi se tax nahi laga sakte hain*. The government now has a clear path forward: if it intends to levy customs duty on electricity supplied from SEZs to DTA, it must do so through proper legislation, not through notifications that attempt to bypass the law.\n\n## Read the Official Document\n*   [Visit the Supreme Court of India website](https://main.sci.gov.in/) (Readers can search for the judgment \"Adani Power Ltd. & Anr. v. Union of India & Ors.\" with Neutral Citation 2026 INSC 1, Civil Appeal No. 22 of 2026 on the official website for details.)\n\n*Published on: 13 January 2026*",
  "type": "blog"
}