# SEBI Reclassifies REITs as Equity: A Game-Changer for MF & SIF Investments (Circular dated Nov 28, 2025)

Kya aap bhi Real Estate Investment Trusts (REITs) ko apni investment portfolio mein shaamil karne ki strategies par re-think kar rahe hain? Ya phir, Mutual Funds (MFs) aur Specified Investment Funds (SIFs) ke liye REIT investments ki classification ko lekar thodi confusion thi? Toh chaliye, Securities and Exchange Board of India (SEBI) ke latest move ko detail mein samajhte hain, jisse real estate sector mein institutional participation kaafi badhne ki ummeed hai.

SEBI ne ek landmark circular jaari kiya hai, dated November 28, 2025, jiske तहत Real Estate Investment Trusts (REITs) ko ab "equity-related instruments" ke roop mein reclassify kar diya gaya hai. Iska seedha matlab hai ki ab Mutual Funds aur Specialized Investment Funds (SIFs) ke liye REITs mein invest karna aur bhi aasaan ho jaayega. Yeh change January 1, 2026, se effective hoga.

## Yeh Poora Maamla Kya Hai? The Reclassification Explained

Traditionally, REITs, jo ki essentially income-generating real estate assets mein invest karte hain, ko equity instruments ki tarah treat nahi kiya jaata tha. Is classification ki wajah se Mutual Funds aur SIFs ke liye unmein invest karne par kuch restrictions lagti thi, khaaskar unke allocation limits ke maamle mein. Debt-oriented schemes mein toh aur bhi challenges the.

Lekin ab, SEBI ne **October 31, 2025** ko ek gazette notification ke through **SEBI (Mutual Funds) Regulations, 1996** mein amendments kiye hain. Iske baad, **November 28, 2025** ko jaari circular ne officially is reclassification ko consolidate kar diya hai. Ab se, Mutual Funds aur SIFs dwara REITs mein kiye gaye naye investments ko "equity-related instruments" mana jayega.

However, yahan ek important clarification hai: **Infrastructure Investment Trusts (InvITs)**, jo infrastructure assets mein invest karte hain, unhe **hybrid instruments** ke roop mein hi classify kiya jaata rahega. Yeh dikhata hai ki SEBI ne REITs ki unique characteristics ko recognize kiya hai, jo unhe equity ke zyaada kareeb laati hain.

## Why This Change? SEBI's Rationale Behind the Move

Aap soch rahe honge ki is badlaav ki zaroorat kya thi? Is reclassification ke peeche SEBI ke kai strategic objectives hain:

*   **Enhanced Participation:** Sabse bada maqsad hai Mutual Funds aur SIFs ki REITs mein भागीदारी badhana. Jab REITs ko equity treat kiya jaayega, toh in institutional investors ke liye apni equity allocation limits ke under unmein invest karna aasaan ho jaayega.
*   **Boosting Real Estate Investment:** Isse overall real estate sector mein investment badhega. REITs ek regulated aur transparent tareeke se real estate mein invest karne ka mauka dete hain, aur ab MFs aur SIFs ke zariye isme aur capital aayega.
*   **Global Alignment:** Globally, REITs ko often equities ki tarah hi treat kiya jaata hai. SEBI ka yeh move international best practices ke saath align karta hai, jisse Indian REIT market global investors ke liye bhi aur attractive banega.
*   **Liquidity and Market Depth:** Institutional participation badhne se REIT units ki trading mein liquidity aayegi, aur market depth bhi increase hogi.

## Impact on Mutual Funds and SIFs: Kya Badlega?

Is reclassification ka MFs aur SIFs ke investment strategies par kaafi gehra asar padega:

### 1. Investment Limits aur Portfolio Allocation

Pehle, MFs aur SIFs ke paas non-equity instruments mein invest karne ke liye specific aur often tighter limits hote the. Ab REITs equity-related category mein aane se, fund managers ke paas apne equity-oriented schemes mein REITs ko accommodate karne ki flexibility badh jaayegi. Isse unhe real estate sector ka exposure apne portfolio mein include karne ka behtar mauka milega.

### 2. "Grandfathering" Clause: Existing Investments ka Kya?

Jin debt schemes mein **December 31, 2025** tak REITs held the, un investments ko **"grandfathered"** kiya jaayega. Iska matlab hai ki unhe immediately sell karne ki zaroorat nahi hogi, aur woh apni maturity tak portfolio mein reh sakte hain. Lekin, SEBI ne Asset Management Companies (AMCs) ko encourage kiya hai ki woh market conditions, liquidity aur investors ke hit ko dhyaan mein rakhte hue, dheere-dheere in REIT holdings ko debt schemes se divest karein.

### 3. Scheme Documents aur AMFI ka Role

AMCs ko apni scheme documents mein zaroori changes karne honge aur addendums issue karne honge. SEBI ne yeh bhi clarify kiya hai ki yeh changes scheme ke **fundamental attributes** mein badlaav nahi maane jaayenge, isliye iske liye unitholders ki approval ki zaroorat nahi padegi.

Furthermore, **Association of Mutual Funds in India (AMFI)** ko REITs ko unki market capitalization ke hisaab se scrips ki classification list mein include karne ke nirdesh diye gaye hain.

### 4. Equity Index Inclusion

REITs ko equity instruments ki tarah treat kiya jaa raha hai, toh naturally yeh sawaal uthta hai ki kya yeh equity indices mein shamil honge? SEBI ne kaha hai ki REITs ko equity indices mein shamil karne ka kaam **July 1, 2026** ke baad hi kiya jaayega. Yeh ek six-month ka cooling-off period provide karega jisse index providers apni methodologies adjust kar sakein.

## Old Provision vs. New Provision: Ek Nazar Mein

Chaliye, ek table se dekhte hain ki kya badlaav aaya hai:

| Feature                     | Old Provision (Pre-Jan 1, 2026)                                 | New Provision (Effective Jan 1, 2026)                                       |
| :-------------------------- | :-------------------------------------------------------------- | :-------------------------------------------------------------------------- |
| **REIT Classification**     | Generally not treated as equity; often had separate/tighter limits for MFs/SIFs. | **"Equity-related instruments"** for MF & SIF investments. |
| **InvIT Classification**    | Hybrid Instruments                                              | **Hybrid Instruments** (No Change). |
| **Impact on MF/SIF Limits** | Investment often fell under non-equity or specific alternative investment limits. | Investment will now fall under **equity allocation limits**, increasing flexibility. |
| **Existing Holdings (Debt Schemes)** | Part of the existing debt scheme portfolio as per old norms.           | **Grandfathered** till maturity (as of Dec 31, 2025). AMCs encouraged to divest. |
| **Scheme Document Changes** | Not required for this reclassification.                         | **Mandatory addendums** by AMCs; not a fundamental attribute change. |
| **AMFI Scrip Classification** | REITs not specifically in equity market cap lists.                 | AMFI to **include REITs** in market capitalization classification. |
| **Equity Index Inclusion**  | Not directly eligible or common.                               | Eligible for inclusion **after July 1, 2026**. |

## Practical Examples: Iska Fayda Kise Hoga?

Chaliye, ek do practical examples se isko aur achhe se samjhte hain:

*   **Example 1: Equity Mutual Fund Manager:** Ek equity mutual fund manager, jo typically apne portfolio ka 65-70% equities mein invest karta hai, ab REITs ko bhi is equity portion ka hissa bana sakta hai. Pehle, agar unhein REITs mein invest karna hota, toh unhein alag se non-equity limits ka dhyaan rakhna padta tha, ya phir unhe equity-oriented fund ki category mein maintain karna mushkil hota. Ab, woh commercial real estate ke growth ka fayda uthane ke liye REITs mein invest kar sakte hain, bina apni core equity strategy ko compromise kiye.
*   **Example 2: SIF with Diversification Goals:** Ek Specified Investment Fund, jiska primary goal high-growth sectors mein diversified exposure lena hai, ab REITs ke through India ke booming real estate sector mein zyaada meaningful way mein participate kar sakta hai. Equity classification se unhe apne overall asset allocation ko balance karna aasaan hoga aur real estate exposure ko equity risk-return profile ke saath align kar paayenge.

## Conclusion: A New Era for Real Estate Investing

SEBI ka yeh decision Indian capital markets ke liye ek bahut hi progressive step hai. REITs ko equity-related instruments ke roop mein reclassify karne se, regulator ne institutional investors ke liye real estate sector ke darwaze aur khole hain. Isse na sirf REIT market mein liquidity badhegi aur depth aayegi, balki investors ko bhi professional management aur transparency ke saath real estate exposure lene ke naye avasar milenge.

Fund managers ab apni investment strategies ko aur better align kar paayenge, aur equity-oriented schemes mein REITs ka inclusion diversification ke naye avenues kholega. Overall, yeh move India ke real estate investment landscape mein ek naya chapter shuru karega, jiska fayda fund houses aur investors, dono ko milega.

## Read the Official Document

*   [Download the Official Notification/Circular here](https://www.sebi.gov.in/sebi_data/attachdocs/nov-2025/1672304918732.pdf)

*Published on: 8 December 2025*
