{
  "id": "supreme-courts-landmark-clarity-dtaa-prevails-on-tds-and-section-361viii-demands-direct-nexus-1769603305928",
  "title": "Supreme Court's Landmark Clarity: DTAA Prevails on TDS, and Section 36(1)(viii) Demands Direct Nexus",
  "slug": "supreme-courts-landmark-clarity-dtaa-prevails-on-tds-and-section-361viii-demands-direct-nexus",
  "date": "28 January 2026",
  "content": "# Supreme Court's Landmark Clarity: DTAA Prevails on TDS, and Section 36(1)(viii) Demands Direct Nexus\n\nAs a practicing Chartered Accountant and legal analyst, I've seen countless discussions, debates, and even heated arguments over two critical areas of income tax law: the supremacy of Double Taxation Avoidance Agreements (DTAAs) over domestic Tax Deducted at Source (TDS) provisions, and the intricate interpretation of \"derived from\" for deductions under **Section 36(1)(viii)**. For years, these issues have been a constant source of ambiguity for taxpayers and tax authorities alike.\n\nWell, good news, *my colleagues*! The Supreme Court of India has recently stepped in, providing much-needed clarity that will undoubtedly shape our tax compliance strategies going forward. This isn't just about winning a case; it's about solidifying fundamental principles of tax jurisprudence.\n\nLet's dive deep into what the Apex Court has clarified.\n\n## DTAA: The Unquestionable King Over Higher TDS Rates\n\nFor a long time, Indian companies making payments to non-residents grappled with a Catch-22 situation. On one hand, DTAAs between India and various countries often prescribe a lower withholding tax rate (say, 10%) for certain incomes like royalties, fees for technical services, or interest. On the other hand, **Section 206AA** of the Income Tax Act, 1961, with its \"notwithstanding\" clause, mandated a higher TDS rate of 20% if the non-resident recipient failed to furnish a Permanent Account Number (PAN). So, what was the correct path? Pay at 10% as per DTAA and risk a demand under Section 206AA, or deduct 20% and potentially over-withhold tax, leading to disputes and higher costs for the foreign entity?\n\n### The Heart of the Dispute: Section 206AA vs. DTAA\n\nThe tax department often argued that Section 206AA, being a specific provision dealing with non-furnishing of PAN, overrides the general provisions of DTAA. They relied heavily on the non-obstante clause in Section 206AA, asserting its supremacy.\n\nHowever, the Supreme Court has unequivocally settled this matter. The Court affirmed that **DTAA provisions will override the domestic tax law, including Section 206AA, when they are more beneficial to the taxpayer**. This means that if a DTAA specifies a lower rate of TDS, that lower rate will apply, even if the non-resident payee does not have or furnish an Indian PAN. The judgment emphasized that domestic tax law must align with India's international treaty obligations, and treaty provisions take precedence in cases of inconsistency.\n\nThis ruling reinforces the long-standing principle enshrined in **Section 90(2)** of the Income Tax Act, which states that where a DTAA exists, the provisions of the Act apply only to the extent they are more beneficial to the assessee. The higher TDS rate under Section 206AA, therefore, cannot be imposed simply due to the absence of PAN if the DTAA provides for a lower rate.\n\n### Key Takeaways for DTAA & TDS:\n\n*   **DTAA Supremacy:** The beneficial rate prescribed under a DTAA will prevail over the 20% TDS rate mandated by Section 206AA for non-PAN holders. *Ab yeh confusion khatam ho gaya!*\n*   **Relief for Indian Payers:** Companies making cross-border payments can now confidently apply the DTAA-specified lower rates (often 10%) without fear of higher demands under Section 206AA, provided treaty conditions are met. This offers significant cash flow relief, especially for those with \"Net of Tax\" contracts.\n*   **Documentation is Key:** While PAN isn't the hurdle anymore, the burden of proving eligibility for treaty benefits now squarely rests on a robust **Tax Residency Certificate (TRC)** for the relevant financial year, along with a duly filled and signed **Form 10F** (even if manually filed due to system limitations for non-PAN holders). A declaration of no Permanent Establishment (PE) in India, where relevant, also becomes crucial.\n\n## Section 36(1)(viii) and the Strict \"Derived From\" Test: No Scope for Incidental Income\n\nNext, let's talk about **Section 36(1)(viii)**, a provision designed to encourage statutory corporations and financial institutions to provide long-term finance for industrial or agricultural development. It allows a deduction for an amount transferred to a special reserve, provided it's from \"profits derived from the business of providing long-term finance\". The tricky part has always been interpreting \"derived from\". How direct does the connection to long-term finance need to be?\n\n### The NCDC Case: A Defining Moment\n\nThe Supreme Court recently addressed this precise conundrum in the context of the **National Cooperative Development Corporation (NCDC)**. NCDC had claimed deductions under Section 36(1)(viii) on various income streams, including:\n\n*   Dividend income from investments in shares.\n*   Interest earned on short-term deposits with banks.\n*   Service charges received for monitoring Sugar Development Fund loans.\n\nThe Assessing Officer, and subsequently the Commissioner (Appeals), ITAT, and the Delhi High Court, had disallowed these claims, asserting that such income was not \"derived from\" the business of providing long-term finance, requiring a direct link.\n\n### The Court's Decision: A First-Degree Nexus is Mandatory\n\nThe Supreme Court upheld the lower court's decisions, delivering a clear message: the phrase \"**derived from**\" in Section 36(1)(viii) mandates a **direct, first-degree nexus** with the business of providing long-term finance.\n\nThe Court explicitly ruled that income streams like dividend income, interest from short-term bank deposits, and service charges, while perhaps attributable to the assessee's broader operations, do not qualify as profits *directly derived* from providing long-term finance. The reasoning was precise:\n*   Dividend income is a return on share capital, not lending activity.\n*   Interest from bank deposits arises from treasury management of surplus funds, not from lending for long-term projects.\n*   Service charges, even if related to a development fund, did not originate from NCDC's own long-term lending operations.\n\nThe Apex Court emphasized that the Legislature, by using the narrowest possible connective verb \"derived from\" (and especially after the Finance Act, 1995 amendment), intended to \"ring-fence\" this fiscal benefit. It's a specific incentive provision, not a blanket exemption for all income earned by financial corporations. Expanding the deduction to unrelated income streams would defeat the legislative intent.\n\n### Implications for Financial Institutions:\n\n*   **Strict Interpretation:** Financial institutions and statutory corporations must now strictly segregate their income streams. Only profits flowing *directly* from genuine long-term financing activities will be eligible for deduction under Section 36(1)(viii).\n*   **Increased Tax Liability:** Income from dividends, short-term deposits, and other ancillary services, which might have previously been claimed for deduction, will now be fully taxable, potentially increasing the effective tax liability for many.\n*   **Revised Tax Planning:** Tax planning strategies that relied on a broader interpretation of \"derived from\" will need to be immediately revisited and restructured. Clear documentation proving the direct nexus of income to long-term finance is paramount.\n\n## Final Thoughts\n\nThese two pronouncements from the Supreme Court are significant, bringing much-needed clarity and certainty to areas that were hotbeds of litigation. The DTAA ruling reaffirms India's commitment to international taxation principles, making cross-border transactions smoother and predictable for both Indian companies and foreign entities. *Yeh toh accha step hai!*\n\nSimilarly, the clarification on Section 36(1)(viii) reinforces the principle of strict interpretation for incentive provisions in tax law. It reminds us that tax benefits are to be availed only as per the precise legislative intent, not through a wide-ranging interpretation of terms.\n\nAs tax professionals, it's crucial for us to assimilate these clarifications into our advisory and compliance frameworks. The legal landscape is always evolving, and staying abreast of such landmark judgments is not just good practice, but an absolute necessity.\n\n## Read the Official Document\n*   [Visit the Supreme Court of India's Judgments Page](https://main.sci.gov.in/judgments)\n\n*Published on: 28 January 2026*",
  "type": "blog"
}