{
  "id": "supreme-court-delivers-landmark-verdict-no-customs-duty-on-power-from-sez-to-domestic-market-a-game-changer-for-sez-units-1768438625821",
  "title": "Supreme Court Delivers Landmark Verdict: No Customs Duty on Power from SEZ to Domestic Market – A Game Changer for SEZ Units!",
  "slug": "supreme-court-delivers-landmark-verdict-no-customs-duty-on-power-from-sez-to-domestic-market-a-game-changer-for-sez-units",
  "date": "15 January 2026",
  "content": "# Supreme Court Delivers Landmark Verdict: No Customs Duty on Power from SEZ to Domestic Market – A Game Changer for SEZ Units!\n\nAs tax professionals, we've often grappled with the complex interplay between the Special Economic Zones (SEZ) regime and our traditional customs laws. One particular area that has consistently sparked debate and litigation is the levy of customs duty on electricity supplied from a unit located in an SEZ to the Domestic Tariff Area (DTA). Well, the Supreme Court has finally brought much-needed clarity, and frankly, a huge sigh of relief for many. In a significant judgment dated January 12, 2026, the apex court has unequivocally set aside the levy of customs duty on power supplied from SEZ to the DTA, settling a long-standing contentious issue.\n\nLet's dive into the details of this landmark ruling and understand its profound implications.\n\n### The Factual Matrix: Adani Power's Enduring Battle\n\nThe genesis of this legal battle lies in the operations of **Adani Power Limited**, which runs a substantial coal-based thermal power plant within the Mundra Special Economic Zone (SEZ) in Gujarat. A significant portion of the electricity generated at this plant was supplied to purchasers located in the Domestic Tariff Area (DTA), including various State distribution utilities.\n\nThe contention arose when the Union Government began to levy customs duty on this electricity supplied from the SEZ to the DTA. This was done through a series of notifications, notably starting with Notification No. 25/2010-Cus. dated February 27, 2010, which initially sought to impose a 16% ad valorem customs duty, with retrospective effect, subsequently altering rates to specific per-unit charges. The revenue authorities viewed this supply as an 'import' into India, thereby attracting customs duty.\n\nAdani Power challenged this levy, arguing that electricity generated within India, even if from an SEZ, cannot be considered an 'import' into India, and thus, customs duty was not leviable. The matter saw a bumpy ride through the legal system:\n*   In 2015, the Gujarat High Court initially ruled in favour of Adani Power, holding that customs duty on electricity generated within India and supplied from an SEZ to the DTA was \"without authority of law\".\n*   However, in 2019, another Gujarat High Court judgment limited the scope of the earlier ruling, implying that the exemption was confined to a specific period and that customs duty remained payable for subsequent periods. This second High Court ruling became the subject of the appeal before the Supreme Court.\n\n### The Legal Conundrum: Unpacking the Provisions\n\nAt the heart of this dispute were three critical legal provisions:\n\n1.  **Section 12 of the Customs Act, 1962:** This is the charging section for customs duty. It unequivocally states that duties of customs shall be levied on goods **\"imported into, or exported from, India\"**. The crucial point here is the requirement of an actual 'import' or 'export'.\n2.  **Section 30 of the Special Economic Zones Act, 2005:** This section deals with goods removed from an SEZ to the DTA. It stipulates that such goods \"shall be chargeable to duties of customs as if such goods had been imported into India\". The government heavily relied on this \"as if imported\" deeming fiction.\n3.  **Section 25 of the Customs Act, 1962:** This section grants the Central Government the power to grant exemptions from customs duty \"in the public interest.\" The notifications imposing duty were issued under this very section, which raised questions about the misuse of exemption powers to create a levy.\n\nThe fundamental question before the Supreme Court was: Can electricity generated within an SEZ and supplied to the DTA be truly considered \"imported into India\" under Section 12 of the Customs Act, especially when imported electricity historically attracted a nil rate of duty? And further, can Section 25, an exemption provision, be used as a tool to impose a new tax?\n\n### The Supreme Court's Resounding Verdict: Upholding Constitutional Principles\n\nThe Supreme Court, comprising Justices Aravind Kumar and N.V. Anjaria, meticulously analyzed the legal framework and delivered a clear verdict, effectively overturning the 2019 Gujarat High Court judgment. The apex court held that customs duty cannot be levied on electricity supplied from an SEZ to the DTA. Here's a breakdown of their pivotal reasoning:\n\n*   **No Charging Event under Customs Act:** The Court emphasized that for customs duty to be leviable, there must be a clear \"charging event\" under Section 12 of the Customs Act. Electricity generated within India and supplied domestically, even if from an SEZ, does not constitute an \"import into India\". The physical movement of electricity from an SEZ to the DTA is an internal supply, not an international import.\n*   **SEZ is Fiscally Distinct, Not Foreign Territory:** While an SEZ is treated as a \"foreign territory\" for certain trade and fiscal purposes, this legal fiction does not extend to the extent of treating an intra-national supply of power as an import from a foreign country. The Court clarified that an SEZ remains within the geographical boundaries of India.\n*   **Limited Scope of Section 30 of SEZ Act:** The \"as if imported\" phrase in Section 30 of the SEZ Act is a parity provision. Its intent is to ensure that goods removed from an SEZ to DTA are subjected to similar duty treatment as comparable imported goods. It is not designed to create an independent charging event where none exists under the Customs Act. Notably, imported electrical energy historically attracted a nil rate of customs duty.\n*   **Misuse of Exemption Power (Section 25):** The Court strongly criticized the government's attempt to impose a levy through exemption notifications issued under Section 25 of the Customs Act. This section is meant for granting exemptions from an existing duty, not for creating a new one. The Court termed this an \"inversion\" of the provision's true purpose. **\"What could not be done directly has been sought to be achieved indirectly, which is impermissible in law,\"** the Court observed.\n*   **Constitutional Mandate – Article 265:** Reinforcing a fundamental tenet of Indian constitutional law, the Court reiterated that \"no tax shall be levied or collected except by authority of law\" (Article 265). Any customs duty demand without explicit statutory backing was declared ultra vires. Executive notifications cannot supersede legislative authority to create tax liabilities.\n*   **Judicial Discipline:** The Court also underscored the importance of judicial discipline and adherence to precedent, emphasizing that once a levy has been declared unlawful by a High Court (as in the 2015 Gujarat High Court judgment), the executive cannot simply reassert the same impost in an altered form or through subsequent notifications.\n\nAs a direct consequence of this ruling, the Supreme Court directed the refund of customs duties collected from Adani Power for the period from September 16, 2010, to February 15, 2016, to be processed within eight weeks without interest.\n\n### Impact and Way Forward: A Clearer Horizon for SEZ Operators\n\nThis judgment is nothing short of a landmark decision, bringing significant relief and much-needed certainty for power generators and other units operating within Special Economic Zones.\n\n*   **Boost for SEZ Investments:** By eliminating the ambiguity and the contested customs duty, the decision enhances the attractiveness of SEZs for power and infrastructure projects, encouraging further investment and growth. This will help maintain the competitive edge that SEZs are designed to offer.\n*   **Clarity on \"Import\" Definition:** The ruling provides crucial clarification on what constitutes \"import into India\" in the context of SEZ-to-DTA transactions, especially for intangible goods like electricity. Yeh ek tareh se, \"doodh ka doodh, paani ka paani\" ho gaya hai.\n*   **Reinforcement of Constitutional Principles:** The judgment strongly reaffirms the constitutional principle that taxation must always have the clear backing of law. It acts as a check on potential executive overreach in using delegated legislation (like exemption notifications) to impose taxes.\n*   **Implications for Other SEZ Supplies:** While specifically pertaining to electricity, the underlying principles of this judgment – regarding the charging event, the nature of SEZ as non-foreign territory, and the limitations of Section 25 – could have persuasive value for other goods or services supplied from SEZ to DTA where similar ambiguities exist.\n\nThis decision reiterates that while the government's objective of revenue collection is understandable, it must always operate within the four corners of constitutional and statutory mandates. The era of imposing customs duty on power supplied from an SEZ to the DTA, merely through notifications without a proper charging provision, is now firmly behind us.\n\n## Read the Official Document\n* [Visit the Supreme Court of India's Official Website here](https://main.sci.gov.in/)\n\n*Published on: 15 January 2026*",
  "type": "blog"
}