{
  "id": "1765202352147",
  "title": "Supreme Court Deciphers GST Maze for Hostel Accommodations: A Landmark Ruling and Future Clarity",
  "slug": "supreme_court_deciphers_gst_maze_for_hostel_accommodations_a_landmark_ruling_and_future_clarity",
  "date": "8 December 2025",
  "content": "# Supreme Court Deciphers GST Maze for Hostel Accommodations: A Landmark Ruling and Future Clarity\n\nEvery now and then, a legal pronouncement comes along that cuts through layers of ambiguity, bringing much-needed clarity for businesses and consumers alike. In the often-complex world of Goods and Services Tax (GST), such clarity is a welcome relief, especially when it touches upon essential services like accommodation. The Supreme Court of India, in its significant judgment delivered on **December 4, 2025**, has done precisely that, settling a long-standing debate on the applicability of GST exemption to hostel accommodations.\n\nAs an Indian Chartered Accountant and Legal Analyst, I've seen firsthand the confusion this issue has caused. From property owners to hostel operators and, ultimately, to students and working professionals, everyone was grappling with inconsistent Advance Rulings (AARs) and Appellate Advance Rulings (AAARs). But ab yeh picture clear ho gayi hai, thanks to the Apex Court.\n\nLet's unpack this landmark decision and understand its implications, alongside the proactive steps taken by the GST Council.\n\n## The Apex Court's Definitive Stand: The State of Karnataka & Anr. vs. Taghar Vasudeva Ambrish & Anr.\n\nThe Supreme Court, through a Division Bench comprising Hon'ble Justices J.B. Pardiwala and K.V. Viswanathan, upheld the Karnataka High Court's verdict, definitively ruling that **leasing of residential premises to an entity that subsequently uses it as a hostel for students and working professionals is exempt from GST**. This judgment primarily addresses the interpretation of the exemption as it stood *prior to the July 2022 amendments*.\n\n### The Genesis of the Dispute\n\nThe controversy stemmed from a case involving a co-owner of a 42-room residential property in Bengaluru. This property was leased to M/s DTwelve Spaces Private Limited, an aggregator that further rented it out as long-term hostel accommodation for students and working professionals. The question before the authorities was whether the rent received by the property owner from the aggregator qualified for GST exemption.\n\nInitially, both the Karnataka Authority for Advance Ruling (AAR) and the Appellate Authority for Advance Ruling (AAAR) denied the exemption. Their primary contention was that a \"hostel\" could not be termed a \"residential accommodation or residential dwelling\" and that the exemption was available only if the *direct lessee* used the premises for their own residence. Essentially, unka kehna tha ki property commercial use ke liye jaa rahi hai, toh GST lagega.\n\nHowever, the Karnataka High Court took a broader view, which has now been affirmed by the Supreme Court.\n\n### Legal Provisions under Scrutiny\n\nThe crux of the matter revolved around **Entry 13 of Notification No. 9/2017-Integrated Tax (Rate) dated 28.06.2017** (prior to its amendment in July 2022). This entry provided an exemption for \"services by way of renting of residential dwelling for use as residence\".\n\n### The Apex Court's Rationale: A Purposive Interpretation\n\nThe Supreme Court's reasoning is both logical and aligned with the legislative intent behind GST exemptions for residential housing. Here are the key takeaways from their analysis:\n\n*   **Ultimate Use as Residence is Paramount:** The Court emphatically stated that the **ultimate use of the property as a residence remains unchanged**, even when an intermediary (like an aggregator) is involved. They observed that a hostel, fundamentally, serves as a place of residence or lodging for students and professionals, albeit for a temporary but significant duration.\n*   **Legislative Intent Prevails over Formalism:** Imposing an 18% GST on the transaction between the property owner and the aggregator would inevitably lead to this burden being passed on to the students and working professionals residing in the hostel. This, the Court highlighted, would directly defeat the legislative intent of the government to make residential dwellings affordable by granting this exemption. The idea was to keep the cost of basic housing low, aur yeh toh seedha uske against jaa raha tha.\n*   **\"Activity-Specific,\" Not \"Person-Specific\" Exemption:** A critical clarification by the bench was that the exemption under Entry 13 is **\"activity-specific\" and not \"person-specific\"**. This means the exemption hinges on *what the property is ultimately used for* (residence) rather than *who the immediate lessee is* (an individual or a registered business entity). The Court rejected the Revenue's argument that the lessee (aggregator) must itself use the premises as a residence.\n*   **Interpreting \"Residential Dwelling\":** Since the term \"residential dwelling\" is not explicitly defined in the GST Act, the Court relied on common parlance, previous jurisprudence, and even the CBIC's Education Guide under the erstwhile Service Tax regime. They concluded that a property configured for long-term stay, like the 42-room building used as a hostel, clearly qualifies as a residential dwelling.\n\n### Implications of the Supreme Court Ruling (for the period prior to July 2022 amendments)\n\nThis judgment offers significant retrospective relief. For the period when Entry 13 was in its unamended form (i.e., prior to July 18, 2022), property owners who leased out residential premises to aggregators for hostel use would now be eligible for the GST exemption. This ruling will certainly aid in settling past disputes and litigations.\n\n## The Evolving Landscape: GST Council's Proactive Steps for Future Clarity\n\nWhile the Supreme Court clarified the historical position, the GST Council had already taken proactive steps to address the taxability of hostel services, particularly for the prospective period.\n\nIn its **53rd meeting held on June 22, 2024**, the GST Council recommended a specific exemption for hostel accommodations. This recommendation was subsequently implemented through **Notification No. 04/2024-Central Tax (Rate) dated July 12, 2024** (effective July 15, 2024), which inserted a new **Entry 12AA** into Notification No. 12/2017-CT(Rate).\n\n### The New Exemption (Entry 12AA)\n\nThis new entry provides an exemption for \"supply of accommodation services having value of supply less than or equal to twenty thousand rupees per person per month provided that the accommodation service is supplied for a minimum continuous period of ninety days\".\n\n*   **Conditions:**\n    *   Monthly charges per person should not exceed ₹20,000.\n    *   The accommodation service must be provided for a minimum continuous period of 90 days.\n*   **Retrospective Benefit:** The GST Council also recommended regularizing GST liability on an \"as is where is\" basis for the period from July 1, 2017, to July 14, 2024, where the conditions of the new exemption (₹20,000/month and 90-day continuous stay) are met. This is a huge relief for past transactions, jisme confusion chal rahi thi.\n\n### Harmonizing the Positions: Old vs. New\n\nThe Supreme Court's judgment on December 4, 2025, primarily interprets Entry 13 for the period *before* the July 2022 amendment. Post-July 2022, the landscape evolved: initially, the exemption for renting to a registered person was removed, and then, the GST Council introduced the specific Entry 12AA (effective July 15, 2024).\n\nThe SC ruling reinforces the principle that residential use, irrespective of the intermediary, should ideally be exempt. The subsequent GST Council clarification formalizes this for a prospective period with specific monetary and duration thresholds. So, in essence, both the judiciary and the executive have converged on the principle of exempting genuine residential accommodation, albeit through different mechanisms and for different timeframes.\n\n## What Does This Mean for You? Practical Takeaways\n\nThis two-pronged approach – the Supreme Court’s definitive interpretation and the GST Council’s prospective clarification – brings significant relief and clarity:\n\n*   **For Property Owners/Lessors:** If you're leasing residential property for long-term hostel/PG use, especially to an aggregator, the Supreme Court's ruling confirms your eligibility for exemption for the period prior to July 2022. For periods from July 15, 2024, onwards, ensure the monthly per-person charge is below ₹20,000 and the continuous stay is 90 days or more.\n*   **For Hostel/PG Operators:** This is big relief for you. You can now operate with more certainty. For past periods where you might have collected GST based on adverse AARs, the SC ruling provides strong grounds for rectifications. For ongoing operations, if you meet the ₹20,000/month and 90-day continuous stay criteria, your services are exempt. This means less compliance burden – no need for GST registration if you only provide exempted services, and no reverse charge mechanism (RCM) applicability on your rentals paid to landlords.\n*   **For Students and Working Professionals:** The ultimate beneficiaries! This clarity ensures that the cost of your accommodation remains affordable, as the burden of 18% GST will not be passed on to you for eligible hostel/PG stays.\n\nIt's a huge positive shift, ensuring that access to affordable residential accommodation isn't unnecessarily burdened by indirect taxes.\n\n## Final Thoughts\n\nThe Supreme Court's judgment in the *Taghar Vasudeva Ambrish* case is a landmark decision, providing a logical and purposive interpretation of GST law concerning residential dwellings. Coupled with the GST Council's subsequent, specific exemption for hostel accommodations, the picture is now significantly clearer. This is a win for common sense, legislative intent, and, most importantly, for the countless students and working professionals across India for whom hostels are a crucial part of their journey.\n\nThe path to interpreting GST provisions has often been challenging, but rulings like this reinforce faith in our legal framework's ability to adapt and provide equitable solutions. So, if you're involved in the hostel or co-living space, make sure your compliance strategy aligns with these latest developments.\n\n## Read the Official Document\n\n*   [Visit the Supreme Court of India website for judgments](https://main.sci.gov.in/)\n*   [Visit the CBIC website for Notifications & Circulars](https://cbic.gov.in/gst.html/Notifications)\n\n*Published on: 8 December 2025*",
  "type": "blog"
}