{
  "id": "union-budget-2026-a-game-changer-for-service-exporters-deleting-igst-acts-section-138b-and-unlocking-zerorating-benefits-1769994688403",
  "title": "Union Budget 2026: A Game Changer for Service Exporters – Deleting IGST Act's Section 13(8)(b) and Unlocking Zero-Rating Benefits",
  "slug": "union-budget-2026-a-game-changer-for-service-exporters-deleting-igst-acts-section-138b-and-unlocking-zerorating-benefits",
  "date": "2 February 2026",
  "content": "# Union Budget 2026: A Game Changer for Service Exporters – Deleting IGST Act's Section 13(8)(b) and Unlocking Zero-Rating Benefits\n\nHello, my dear colleagues! We've just heard some truly groundbreaking news from the **Union Budget 2026**, announced on February 1, 2026, that's set to revolutionize how we look at **intermediary service taxation** in India. For years, one particular provision, **Section 13(8)(b) of the Integrated Goods and Services Tax (IGST) Act**, 2017, has been a constant source of confusion and litigation for our service exporters. But, the word from the Budget is that this contentious clause is finally on its way out! And frankly, *yeh toh hona hi tha*.\n\nThis proposed deletion isn't just a minor tweak; it's a fundamental shift that promises to bring much-needed clarity and relief, especially to India's burgeoning service export sector. Let's deep dive into what this means for businesses and the broader economy.\n\n## The Sticky Wicket: Understanding Section 13(8)(b) and Its Challenges\n\nFor a long time, if you were an intermediary service provider in India—think IT support, BPO, consultancy, marketing, or any service that facilitates a supply between two other persons—and your client was located outside India, you faced a unique GST predicament. Why? Because **Section 13(8)(b) of the IGST Act** stipulated that the **place of supply** for intermediary services would be the **location of the supplier** of the services.\n\nNow, *suniye*, this seemingly innocuous rule had profound implications.\n*   **Denial of Export Status:** Even if you were providing services to a foreign client, earning foreign exchange, and fulfilling all other conditions of an \"export of service\" as defined under GST law, Section 13(8)(b) effectively treated your supply as domestic. This meant it was taxable in India.\n*   **No Zero-Rating Benefits:** As these services weren't considered exports, they were ineligible for the crucial **zero-rating benefit**, which means tax paid on input services and goods couldn't be claimed as a refund. *Toh, GST lagao aur refund bhool jao.* This directly impacted working capital and added to the cost of doing business.\n*   **Double Taxation Risk:** In many cases, the same service might also attract tax in the client's country, leading to potential **double taxation**, a scenario businesses actively try to avoid.\n*   **Litigation Galore:** The broad definition of \"intermediary\" and the specific rule under Section 13(8)(b) led to a significant amount of disputes and litigation between taxpayers and tax authorities. Courts had to frequently interpret whether a service constituted an 'intermediary service' or a principal service.\n\nThis provision created an uneven playing field for Indian service providers competing with global counterparts, effectively stifling their export potential.\n\n## The Proposed Solution: Deletion of Section 13(8)(b)\n\nThe **Union Budget 2026**, announced on February 1, 2026, has taken a decisive step to address these long-standing issues by proposing the **deletion of Section 13(8)(b)** from the IGST Act. This is indeed a landmark reform for India Inc..\n\n### Old Provision vs. New Provision: A Clearer Path Ahead\n\nLet's look at the direct impact this deletion will have:\n\n| Aspect                     | Old Provision (Before Deletion)                                                                                                                                                                                                                                                                  | New Provision (After Deletion of Section 13(8)(b))                                                                                                                                                                                                                                                                  |\n| :------------------------- | :--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | :-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| **Legal Basis**            | **Section 13(8)(b) of IGST Act**: Stated that the place of supply for intermediary services is the location of the supplier.                                                                                                                                                           | **Deletion of Section 13(8)(b)** means this specific rule no longer applies. The general rule for cross-border services will govern.                                                                                                                                                             |\n| **Place of Supply (POS)**  | For intermediary services supplied to foreign recipients, POS was deemed to be in India (location of the Indian supplier).                                                                                                                                                          | The POS for intermediary services to foreign recipients will now revert to the **general rule under Section 13(2) of the IGST Act**, which states that the POS is the **location of the recipient of services**.                                                                                     |\n| **Export Status**          | Services to foreign clients were often *not* treated as exports, even if consideration was received in foreign currency, due to the POS being in India.                                                                                                                             | With POS now being the location of the foreign recipient, these services will generally qualify as **\"export of services\"** (subject to other conditions).                                                                                                                                         |\n| **GST Liability & Refunds** | Indian intermediaries were liable for IGST and were largely denied input tax credit refunds, leading to increased costs and working capital blockage.                                                                                                                       | Qualifying as exports, these services will be **zero-rated**. This means no IGST will be levied on outward supply, and input tax credit will be available for refund, significantly easing the burden on service exporters.                                                                       |\n| **Competitiveness**        | Put Indian service providers at a disadvantage compared to international competitors due to local GST levy.                                                                                                                                                                  | Enhances the global competitiveness of Indian service exporters by removing the tax burden and aligning India's tax treatment with international norms.                                                                                                                                         |\n| **Import of Services**     | For intermediary services imported into India (foreign supplier, Indian recipient), the place of supply was the location of the foreign supplier.                                                                                                                                                 | With the deletion, intermediary services imported into India will now become taxable under the **Reverse Charge Mechanism (RCM)**, ensuring tax neutrality and bringing them into the tax net.                                                                                                          |\n\nThis proposed change is a huge sigh of relief for our service industry. It's about bringing back the \"destination-based consumption tax\" principle to its true spirit in cross-border service transactions. *Ab seedha-seedha baat hogi!*\n\n## Broader Impact and Future Outlook\n\nThe deletion of Section 13(8)(b) is more than just a legal amendment; it's a strong policy statement from the government.\n*   **Boost to Service Exports:** This move will significantly boost India's service exports, making Indian businesses more competitive on the global stage. Sectors like IT, ITES, KPO, and other business support services stand to gain immensely.\n*   **Reduced Litigation:** The removal of this contentious provision is expected to drastically reduce the volume of disputes and litigations that currently plague this sector, leading to greater ease of doing business.\n*   **Aligned with Global Practices:** This amendment brings India's GST framework closer to international taxation principles, where typically, the place of supply for such services is determined by the recipient's location.\n*   **Working Capital Relief:** Businesses will no longer have their working capital locked up in irrecoverable GST on their export services. This is a big win for cash flow management.\n\nWhile the deletion of Section 13(8)(b) is a fantastic step, it's also crucial to remember that the definition of an 'intermediary' itself remains in the law. Businesses will still need to carefully assess whether their services genuinely fall under the 'intermediary' definition or if they are providing services on a principal-to-principal basis. This distinction will continue to be important.\n\nIn essence, the **Union Budget 2026** has delivered a much-anticipated reform that truly empowers Indian service exporters. It underscores a commitment to foster an environment where Indian businesses can thrive globally without being burdened by anomalous tax provisions. This is a progressive step, *aur hum sab ko iska fayda uthana chahiye*.\n\n## Read the Official Document\n* [Visit the Central Board of Indirect Taxes and Customs (CBIC) website for updates on notifications and circulars](https://www.cbic.gov.in/)\n\n*Published on: 2 February 2026*",
  "type": "blog"
}