{
  "id": "indiafrance-dtaa-decoding-the-amending-protocol-of-february-2026-a-new-era-of-tax-certainty-1772240580944",
  "title": "India-France DTAA: Decoding the Amending Protocol of February 2026 – A New Era of Tax Certainty?",
  "slug": "indiafrance-dtaa-decoding-the-amending-protocol-of-february-2026-a-new-era-of-tax-certainty",
  "date": "28 February 2026",
  "content": "# India-France DTAA: Decoding the Amending Protocol of February 2026 – A New Era of Tax Certainty?\n\nNamaste and greetings to all my esteemed colleagues in the world of tax and law! It's always an interesting time when DTAAs get a fresh look, isn't it? Just last week, on February 23, 2026, India and France inked an Amending Protocol to their existing Double Taxation Avoidance Convention (DTAC), which was originally signed way back on September 29, 1992. This isn't just a minor tweak; this protocol signifies a substantial shift in the tax landscape for cross-border transactions between our two nations.\n\nFor us professionals, these updates mean revisiting our existing structures, re-evaluating tax positions, and strategizing for future investments. The Central Board of Direct Taxes (CBDT) has issued a press release highlighting these crucial amendments, aiming to align the treaty with current international tax standards, provide greater tax certainty, and foster stronger economic ties. So, let's dive deep and understand what's changed and what it means for businesses and investors.\n\n## The Winds of Change: Why This Amendment Now?\n\nYou might ask, \"Why the sudden overhaul of a decades-old treaty?\" Well, my friends, the global tax environment has been in a constant state of flux, largely driven by the OECD/G20 Base Erosion and Profit Shifting (BEPS) project. India, like many other nations, has been actively engaged in updating its treaty network to prevent treaty abuse, ensure fair allocation of taxing rights, and foster transparency. The signing of this protocol, particularly during the recent visit of the French President to India, underscores the strategic importance both countries place on modernizing their economic partnership. It’s about building a robust framework that supports genuine investment while curbing aggressive tax planning.\n\n## Key Changes: What's New on the Treaty Table?\n\nThis Amending Protocol introduces several significant modifications. Let’s break down the most impactful ones.\n\n### 1. Capital Gains on Sale of Shares: Source Country Takes the Lead\n\nThis is perhaps one of the most talked-about changes. Previously, French resident investors often enjoyed certain exemptions on capital gains from the sale of shares of an Indian company, particularly if their shareholding was below 10% and the Indian company didn't primarily derive value from immovable property. *Ab yeh rule applicable nahi hai, bhaiyon!*\n\nThe Amending Protocol now grants full taxing rights in respect of capital gains arising from the sale of shares to the jurisdiction where the company whose shares are being transferred is a resident. What does this mean in simple terms? If a French resident sells shares of an Indian company, India will now have the full authority to tax those capital gains, regardless of the percentage of holding. This move effectively sunsets the \"portfolio exemption\" that was present in the old treaty.\n\n| Old Provision (Pre-Feb 23, 2026)                                                                                                                                                                             | New Provision (Post-Feb 23, 2026)                                                                                                                                                                                                                                              |\n| :----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | :--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| Generally, capital gains from sale of shares of an Indian company by a French resident were taxable in France, with exceptions for significant immovable property holdings or large shareholdings (10% or more). | Full taxing rights on capital gains arising from the sale of shares of a company are now allocated to the country where the company is a resident. This means India can now tax such gains from the sale of Indian company shares by French residents. |\n\nThis change brings the India-France DTAA in line with India's broader treaty renegotiation strategy, which focuses on source-based taxation for capital gains, as seen in other updated treaties. It's a clear signal to investors to reassess their exit strategies and potential tax liabilities.\n\n### 2. Deletion of the Most-Favoured-Nation (MFN) Clause: Clarity Prevails\n\nThe MFN clause has been a long-standing point of contention and interpretational ambiguity in many of India's DTAAs. The good news is, the Amending Protocol explicitly removes the Most-Favoured-Nation clause from the existing DTAC Protocol.\n\n| Old Provision (Pre-Feb 23, 2026)                                                                                                                                     | New Provision (Post-Feb 23, 2026)                                                                                                                                                                                                                                                                                                         |\n| :------------------------------------------------------------------------------------------------------------------------------------------------------------------- | :---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| The DTAA contained an MFN clause, meaning if India offered better tax benefits to another OECD member country in a future treaty, France could automatically claim the same benefits. | The MFN clause has been explicitly deleted from the Protocol to the DTAC. This resolves all interpretational and implementation issues associated with the clause, simplifying the treaty structure and aligning with the Supreme Court's stance on automatic MFN invocation. |\n\nThis deletion is particularly significant given the Indian Supreme Court's landmark decision in late 2023, which clarified that MFN benefits cannot be automatically invoked unless specifically notified. By removing this clause, India has brought \"to rest all issues relating to it,\" creating much-needed certainty and avoiding future disputes on this front.\n\n### 3. Revised Taxation of Dividends: A Differentiated Approach\n\nThe taxation of dividends has also seen a material change, moving from a single rate to a split-rate structure.\n\n| Old Provision (Pre-Feb 23, 2026)                 | New Provision (Post-Feb 23, 2026)                                                                                                |\n| :----------------------------------------------- | :------------------------------------------------------------------------------------------------------------------------------- |\n| A uniform 10% tax rate on dividends. | - **5% tax rate:** Applicable where the beneficial owner holds at least 10% of the capital of the dividend-paying company. <br> - **15% tax rate:** Applicable in all other cases (i.e., holding less than 10% of capital). |\n\nThis differentiated approach is a common feature in modern DTAAs and is designed to incentivize strategic, long-term investments by offering a lower withholding tax rate to substantial shareholders. For portfolio investors with smaller holdings, however, the dividend tax rate will see an increase. This shift could impact French foreign portfolio investors who have significant stakes in Indian companies.\n\n### 4. Modification to Fees for Technical Services (FTS): Alignment with US DTAA\n\nThe definition of 'Fees for Technical Services' (FTS) has been a source of frequent litigation. The Amending Protocol modifies this definition to align it with the definition contained in the India-US Double Taxation Avoidance Agreement. This alignment is a welcome step, as it is expected to enhance consistency in treaty interpretation and reduce disputes related to the characterization and taxation of technical service payments. *Bahut zaroori tha yeh simplification!*\n\n### 5. Expansion of Permanent Establishment (PE) Scope: Hello, Service PE!\n\nThe scope of 'Permanent Establishment' (PE) has been expanded with the explicit inclusion of a **Service Permanent Establishment (Service PE)** clause. This means that service providers from one country rendering services in the other country for a specified duration could now trigger a PE, leading to taxation of business profits in that source country. For French entities providing services in India, or vice-versa, it’s critical to reassess their operational models and physical presence to avoid unintended PE exposure.\n\n### 6. Strengthening Exchange of Information and Tax Cooperation\n\nIn line with global efforts to combat tax evasion and aggressive tax planning, the Amending Protocol updates the provisions on Exchange of Information and introduces a new Article on **Assistance in Collection of Taxes**. These updates are crucial for enabling seamless exchange of information and strengthening mutual tax cooperation between India and France, ensuring that taxpayers cannot hide assets or income across borders.\n\n### 7. Incorporation of BEPS MLI Provisions: Anti-Abuse Measures Are Here\n\nThe Amending Protocol also formally incorporates into the DTAC the applicable provisions of the **Base Erosion and Profit Shifting (BEPS) Multilateral Instrument (MLI)**. While these provisions had already become applicable following the signing and ratification of the MLI by both India and France, their direct incorporation into the bilateral treaty provides greater clarity and certainty in treaty application. Notably, this includes the formal adoption of the **Principal Purpose Test (PPT)**, a key anti-abuse measure that denies treaty benefits if obtaining those benefits was one of the principal purposes of an arrangement or transaction. This reinforces India's commitment to tackling treaty shopping and ensuring that treaty benefits are only available for genuine commercial activities.\n\n## Final Thoughts\n\nThis Amending Protocol is a significant step forward, modernizing a decades-old treaty and bringing it in line with current international tax standards and India's evolving tax policy. While it introduces greater certainty in many areas, it also demands a proactive review from taxpayers.\n\nFor businesses and investors with existing or planned operations between India and France, it's *imperative* to:\n*   **Re-evaluate capital gains tax implications** on the sale of shares. This is a big one!\n*   **Assess dividend repatriation strategies** in light of the new split-rate withholding tax structure.\n*   **Review service arrangements** to understand potential Service PE exposures.\n*   **Ensure compliance with anti-abuse provisions**, particularly the Principal Purpose Test.\n\nThe changes will become effective after both countries complete their internal legal procedures, so keep an eye out for further notifications on the exact dates of entry into force. This is not just a regulatory update; it's a recalibration of the economic relationship between two major global players. As tax professionals, our role now is to guide our clients through this new landscape, helping them navigate the nuances and optimize their structures in a compliant manner.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.pib.gov.in/PressReleasePage.aspx?PRID=2231751)\n\n*Published on: 28 February 2026*",
  "type": "blog"
}