{
  "id": "indias-supreme-court-stiffens-resolve-against-treaty-shopping-tiger-global-denied-mauritius-dtaa-benefits-gaar-prevails-1769216240050",
  "title": "India's Supreme Court Stiffens Resolve Against Treaty Shopping: Tiger Global Denied Mauritius DTAA Benefits, GAAR Prevails",
  "slug": "indias-supreme-court-stiffens-resolve-against-treaty-shopping-tiger-global-denied-mauritius-dtaa-benefits-gaar-prevails",
  "date": "24 January 2026",
  "content": "# India's Supreme Court Stiffens Resolve Against Treaty Shopping: Tiger Global Denied Mauritius DTAA Benefits, GAAR Prevails\n\nFriends and colleagues, let's talk about a recent development that has sent ripples across the landscape of international taxation in India. The Supreme Court, in a landmark judgment delivered on January 15, 2026, has firmly upheld the **General Anti-Avoidance Rule (GAAR)**, denying the benefits of the India-Mauritius Double Taxation Avoidance Agreement (DTAA) to Tiger Global's Mauritius-based entities. This decision is a game-changer, reaffirming India's \"substance over form\" approach and signalling a new era of scrutiny for foreign investments.\n\nFor years, many foreign investors, particularly private equity and venture capital funds, structured their Indian investments through Mauritius. The primary allure? The erstwhile beneficial tax treaty that offered an exemption from capital gains tax in India. But as they say, *har acchhe din ka ant hota hai*, and this ruling clearly marks that turning point.\n\n## The Genesis of the Dispute: Tiger Global's Flipkart Exit Under Scrutiny\n\nThe case revolved around the taxability of capital gains arising from Tiger Global's significant stake sale in Flipkart to Walmart in 2018, valued at approximately USD 1.6 billion. Tiger Global's investment was routed through its Mauritius-based entities – Tiger Global International II Holdings, Tiger Global International III Holdings, and Tiger Global International IV Holdings. These entities, holding valid Tax Residency Certificates (TRCs) issued by the Mauritius Revenue Authority, contended that the capital gains from this indirect transfer of shares were exempt from tax in India under Article 13(4) of the India-Mauritius DTAA.\n\nThe journey of this dispute has been quite a legal *rollercoaster*. The Authority for Advance Rulings (AAR) initially denied treaty benefits, asserting that the Mauritius entities were mere \"conduit companies\" lacking commercial substance and that their \"head and brain\" (effective control and management) actually resided in the USA. The Delhi High Court, however, overturned the AAR's order, ruling in favour of Tiger Global and holding that they were entitled to treaty benefits. This set the stage for the crucial battle at the Supreme Court.\n\n## The Legal Labyrinth: DTAA, TRCs, and the GAAR Overhang\n\nTo truly appreciate the Supreme Court's pronouncement, we need to understand the interplay of three critical elements:\n\n*   **India-Mauritius DTAA:** Historically, this treaty, especially prior to its amendment, provided a significant advantage, often leading to zero capital gains tax in India on the sale of Indian company shares by a Mauritius resident. This provision was a cornerstone of what was widely known as the \"Mauritius Route\" for foreign investments into India.\n*   **Tax Residency Certificates (TRCs):** For a long time, TRCs issued by the Mauritius Revenue Authority were considered conclusive proof of tax residency, effectively serving as a gateway to treaty benefits.\n*   **General Anti-Avoidance Rule (GAAR):** Introduced in India with effect from April 1, 2017, GAAR is an anti-tax evasion measure designed to empower Indian authorities to deny tax benefits for arrangements whose primary purpose is tax avoidance. It prioritizes the economic substance of transactions over their legal form. The triggering conditions for GAAR include arrangements lacking commercial substance, creating artificial rights or obligations, or exploiting loopholes primarily for tax benefits.\n\nThe core conflict lay in whether the legal form (Mauritius residency with TRCs) should prevail, or if the underlying economic substance and the spirit of GAAR should dictate the taxability.\n\n## Supreme Court's Verdict: Upholding Substance Over Form with Conviction\n\nThe Supreme Court, in its judgment dated January 15, 2026, unequivocally sided with the revenue, setting aside the Delhi High Court's decision and reinstating the AAR's substance-over-form approach. The apex court's pronouncements are loud and clear:\n\n*   **TRCs are Not a Carte Blanche:** The Court held that while a Tax Residency Certificate is an \"eligibility condition\" under Section 90(4) of the Income-tax Act, 1961, it is **not sufficient** evidence of residency for the blanket claim of treaty benefits. The mere existence of a TRC does not preclude the Revenue from inquiring into arrangements established primarily for tax avoidance.\n*   **Economic Substance is Paramount:** The Supreme Court emphasized the crucial need for **economic substance, control, and management** within the treaty jurisdiction. It concluded that the \"head and brain\" of the Tiger Global entities did not genuinely lie in Mauritius but rather in the USA. This meant that the India-Mauritius DTAA benefits could not be claimed mechanically, especially if the Mauritian entity was merely a conduit.\n*   **GAAR's Supremacy Over Treaty Benefits:** Crucially, the Court affirmed that **GAAR overrides tax treaties** where the primary purpose of an arrangement is to obtain a tax benefit through avoidance. This means that even if a treaty provision *appears* to offer an exemption, GAAR can be invoked to deny that benefit if the arrangement is found to be an impermissible tax avoidance scheme. The Court noted that the transactions in this case constituted impermissible tax-avoidance arrangements and, *prima facie*, failed to qualify as lawful.\n*   **Dilution of Grandfathering Protection:** A significant observation by the Court was the dilution of the **grandfathering protection** under Rule 10U(1)(d), which was initially intended to shield investments made before April 1, 2017, from GAAR. The Court clarified that this rule cannot be interpreted as a blanket protection from treaty abuse. GAAR will still apply if a tax benefit exceeding ₹3 Crores is obtained on or after April 1, 2017, irrespective of the investment date, provided the investments lack genuine commercial substance.\n*   **Burden of Proof Shifts to Taxpayer:** Once the anti-abuse provisions under GAAR are validly invoked, the burden of proof shifts squarely to the taxpayer to demonstrate the genuineness of the transaction and that the arrangement had commercial substance independent of tax benefits.\n\n## The Far-Reaching Implications for Foreign Investment\n\nThis Supreme Court judgment has profound implications, marking a significant shift in India's tax jurisprudence:\n\n*   **End of Automatic DTAA Claims:** The days of relying solely on TRCs for claiming treaty benefits are *over*. Foreign investors must now demonstrate genuine economic substance, independent decision-making, and a clear commercial rationale for their intermediary holding structures. *Sirf Mauritius mein company kholne se ab kaam nahi chalega.*\n*   **Increased Scrutiny and Compliance Burden:** FIIs, FPIs, and other foreign investors, particularly those structured through jurisdictions like Mauritius, will face heightened scrutiny from Indian tax authorities. There will be an increased emphasis on proving business purpose and economic activity in the treaty jurisdiction.\n*   **Review of Legacy Structures:** Even investments made prior to April 1, 2017, which were thought to be grandfathered, are now under the GAAR scanner if they are found to be lacking commercial substance and are primarily for tax avoidance. Investors need to review their existing structures with a fresh lens.\n*   **Elevated Tax Litigation Risk:** The ruling is likely to trigger increased tax litigation, especially for cases involving treaty benefits and the application of GAAR. The clarity sought by many has come with a stricter interpretation of anti-avoidance provisions.\n*   **Impact on Investment Climate:** While some might argue that this could dampen foreign investment, the government's stance is clear: investments are welcome, but not at the cost of genuine tax liabilities. It promotes a more transparent and equitable tax environment.\n\n## Conclusion: A New Era of Tax Transparency\n\nThe Supreme Court's judgment in the Tiger Global case serves as a powerful reminder that India is resolute in its commitment to curb aggressive tax planning and treaty shopping. It firmly establishes GAAR's overriding power when arrangements are *prima facie* designed for tax avoidance, irrespective of formal documentation like TRCs. This decision is a crucial step towards fostering a robust, fair, and transparent tax regime that prioritizes substance over mere legal form.\n\nAs tax professionals, it's our duty to guide our clients through this evolving landscape. The message is clear: a genuine business purpose and demonstrable economic substance are not just good practices, but essential prerequisites for availing tax treaty benefits in India.\n\n## Read the Official Document\n*   [Visit the Supreme Court of India's website for judgments and orders](https://main.sci.gov.in)\n\n*Published on: 24 January 2026*",
  "type": "blog"
}