{
  "id": "navigating-the-new-landscape-mca-revamps-adjudication-with-revised-roc-jurisdictions-so-698e-dated-10th-february-2026-1771549731202",
  "title": "Navigating the New Landscape: MCA Revamps Adjudication with Revised RoC Jurisdictions (S.O. 698(E) dated 10th February 2026)",
  "slug": "navigating-the-new-landscape-mca-revamps-adjudication-with-revised-roc-jurisdictions-so-698e-dated-10th-february-2026",
  "date": "20 February 2026",
  "content": "# Navigating the New Landscape: MCA Revamps Adjudication with Revised RoC Jurisdictions (S.O. 698(E) dated 10th February 2026)\n\nEvery professional in the corporate compliance ecosystem knows the drill: stay updated, or risk falling behind. The Ministry of Corporate Affairs (MCA) keeps us on our toes, and their latest move, **Notification S.O. 698(E) dated 10th February 2026**, is a significant one that demands our immediate attention. This notification, effective from **16th February 2026**, doesn't just shuffle administrative responsibilities; it fundamentally redefines the territorial jurisdiction of Registrars of Companies (RoCs) as Adjudicating Officers (AOs) under Section 454 of the Companies Act, 2013. So, what exactly has changed, and how will it impact our corporate compliance strategies? Let's deep dive.\n\n## The 'What': Re-appointing RoCs as Adjudicating Officers with Granular Jurisdictions\n\nAt its core, this notification is an exercise of the powers conferred by **Section 454 of the Companies Act, 2013**, read with the **Companies (Adjudication of Penalties) Rules, 2014**. The Central Government has officially appointed various RoCs as Adjudicating Officers. This isn't entirely new; RoCs have previously held these powers. However, the crucial aspect here is the *revision* and *clarification* of their **territorial jurisdiction**.\n\nThe notification explicitly supersedes earlier notifications on the subject, specifically S.O. 831(E) dated 24th March 2015 and S.O. 2650(E) dated 25th July 2019. This means that, barring actions already completed under the old regime, we're now operating under an entirely new jurisdictional framework.\n\nA key highlight is the move towards a more granular, state and district-wise mapping of jurisdiction. For instance, larger states with higher corporate activity, such as Delhi, Uttar Pradesh, Maharashtra, Tamil Nadu, and West Bengal, have seen their jurisdictions bifurcated or even trifurcated, creating multiple RoC offices for specific districts or zones. This demarcation aims to ensure comprehensive national coverage and eliminate any lingering ambiguities regarding which RoC holds authority over which company.\n\n## The 'Why': Streamlining Adjudication and Enhancing Efficiency\n\nWhy this revamp, and why now? The MCA's objective is clear: to streamline the adjudication process for penalties under the Companies Act, 2013. We all know that efficiency is paramount in the corporate world, and often, jurisdictional ambiguities can lead to delays and unnecessary complications. By providing a clear and specific demarcation of powers, the government intends to:\n\n*   **Improve Efficiency:** A clear allocation of cases to specific RoCs should lead to faster processing and disposal of adjudication matters. *Ab idhar udhar bhatakne ka chance kam ho jayega, right?*\n*   **Reduce Delays:** With defined boundaries, the time spent on determining the correct forum for a compliance issue should significantly reduce.\n*   **Enhance Clarity:** Companies and professionals will now have a clearer understanding of which Adjudicating Officer is competent to hear their case. This clarity is crucial for effective compliance and dispute resolution.\n*   **Strengthen Regulatory Oversight:** A well-defined jurisdictional framework allows for better monitoring and enforcement of corporate laws across the country.\n\n## The 'How': Impact on Professionals and Companies\n\nThis notification has direct implications for how we, as professionals, advise our clients and how companies manage their compliance.\n\n### Revised Territorial Jurisdiction of Adjudicating Officers\n\n| Old Provision (Prior to Feb 16, 2026)                                                                                                    | New Provision (Effective from Feb 16, 2026)                                                                                                                                                                                                                                                                                                                                                                                                                         |\n| :--------------------------------------------------------------------------------------------------------------------------------------- | :---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| Broader, often state-wide or multi-state jurisdiction for RoCs as Adjudicating Officers, potentially leading to ambiguities in some cases. | **Detailed and Granular Mapping:** Jurisdiction is now clearly defined across specific States, Union Territories, and even individual districts. <br> **Multi-Zone Structures:** Large and high-volume jurisdictions like Delhi, Uttar Pradesh, Maharashtra, Tamil Nadu, and West Bengal have been split into multiple zones, each with a designated RoC as AO. For example, Delhi now has RoC-NCT Delhi-I and RoC-NCT Delhi-II, covering distinct sets of districts. <br> **Supersedes earlier notifications** of 2015 and 2019, bringing a completely updated and more structured framework into force. |\n\n### Appellate Mechanism Remains Clear\n\nThe notification also reiterates the appellate mechanism. Any appeals against orders passed by these newly appointed or re-designated Adjudicating Officers shall lie before the concerned **Regional Director** having jurisdiction over the Adjudicating Office. This appellate structure aligns with the framework established by the Government notification dated **23rd October 2025**. This consistency in the appeal process provides much-needed stability even with the changes at the initial adjudication level.\n\n### Treatment of Pending Cases\n\nWhat about proceedings already underway? The notification clarifies that **all proceedings pending before Adjudicating Officers, and appeals pending before Regional Directors as on the date of commencement (16th February 2026), shall, from that date, be dealt with in accordance with this new notification.** This means that even ongoing matters will be governed by the revised jurisdictional framework, ensuring a smooth transition and preventing prolonged reliance on superseded provisions.\n\n## Final Thoughts: A Step Towards Enhanced Corporate Governance\n\nThe MCA's Notification S.O. 698(E) is a proactive step towards enhancing corporate governance and streamlining the enforcement of the Companies Act, 2013. By providing clearer jurisdictional boundaries for RoCs acting as Adjudicating Officers, the Ministry aims to foster greater efficiency, reduce compliance bottlenecks, and bring more certainty to the adjudication of penalties. For us professionals, it's a reminder to update our understanding of these territorial divisions and guide our clients accordingly. *Yeh toh acchi baat hai, compliance mein aur clarity milegi!*\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.mca.gov.in/content/mca/global/en/acts-rules/rules-notifications/notifications.html)\n\n*Published on: 20 February 2026*",
  "type": "blog"
}