{
  "id": "nclts-domain-delineated-supreme-court-clarifies-jurisdiction-over-trademark-title-disputes-in-insolvency-proceedings-1769862309537",
  "title": "NCLT's Domain Delineated: Supreme Court Clarifies Jurisdiction Over Trademark Title Disputes in Insolvency Proceedings",
  "slug": "nclts-domain-delineated-supreme-court-clarifies-jurisdiction-over-trademark-title-disputes-in-insolvency-proceedings",
  "date": "31 January 2026",
  "content": "# NCLT's Domain Delineated: Supreme Court Clarifies Jurisdiction Over Trademark Title Disputes in Insolvency Proceedings\n\nAs seasoned professionals navigating the intricate landscape of India's insolvency regime, we often encounter situations where the boundaries of jurisdiction become a bit *fuzzy*, don't we? Especially when valuable intellectual property (IP) assets, like trademarks, are involved in a Corporate Insolvency Resolution Process (CIRP). For quite some time, there's been a lingering question: just how far can the National Company Law Tribunal (NCLT) go in deciding complex ownership disputes over such assets?\n\nWell, the Supreme Court has now provided much-needed clarity on this critical aspect. In a significant judgment delivered on January 22, 2026, in the case of **Gloster Limited v. Gloster Cables Limited & Ors.**, the Apex Court has firmly delineated the NCLT's jurisdiction, asserting that it cannot, under its residuary powers, adjudicate disputed questions of title to intellectual property that do not have a direct and intrinsic nexus with the insolvency proceedings themselves. This ruling is a *game-changer* for insolvency professionals, corporate debtors, and anyone dealing with IP during CIRP.\n\n## The Conundrum: When IP Gets Tangled in Insolvency\n\nThink about it: a corporate debtor is undergoing CIRP. It possesses a valuable trademark. Suddenly, another entity claims ownership of that very trademark, perhaps based on old agreements, assignments, or a history of usage. What happens then? Does the NCLT, which is primarily an insolvency adjudicating authority, have the mandate to delve into the nitty-gritty of trademark law and declare who the rightful owner is? Or should such a dispute be referred to a specialized civil or commercial court?\n\nBefore this judgment, there was a degree of ambiguity. While **Section 60(5)(c) of the Insolvency and Bankruptcy Code, 2016 (IBC)** grants the NCLT broad powers to entertain and dispose of \"any question of law or facts arising out of or in relation to the insolvency resolution or liquidation proceedings of the corporate debtor or corporate person under this Code,\" its exact scope concerning pre-existing civil disputes, especially involving IP, wasn't always clear. This often led to delays and jurisdictional tug-of-wars, adding layers of complexity to an already time-sensitive insolvency process.\n\n## The Gloster Saga: Facts that Led to Clarity\n\nThe background of the *Gloster* case perfectly illustrates this predicament. **Fort Gloster Industries Limited (FGIL)**, the corporate debtor, was undergoing CIRP. During the process, a bitter dispute erupted over the ownership of the well-known \"Gloster\" trademark between **Gloster Limited (the Successful Resolution Applicant - SRA)** and **Gloster Cables Limited (GCL)**.\n\nThe controversy wasn't simple; it had a long history, stemming from a series of complex agreements between FGIL and GCL dating back to the 1990s. These included technical collaboration, licensing arrangements, a loan secured by a charge over the trademark, and a conditional assignment that was later confirmed. Crucially, a BIFR order from an earlier period also complicated the matter.\n\nInitially, the NCLT declared the \"Gloster\" trademark as an asset of the corporate debtor (FGIL), effectively vesting its ownership in the SRA. The National Company Law Appellate Tribunal (NCLAT) later overturned this specific finding regarding ownership but affirmed the NCLT's jurisdiction to delve into the matter. This set the stage for the Supreme Court to finally settle the jurisdictional question.\n\n## The Supreme Court's Verdict: A Narrower Lens for NCLT\n\nThe Supreme Court, comprising Justice J.B. Pardiwala and Justice K.V. Viswanathan, meticulously examined the interplay between the IBC and other specific laws governing property and intellectual property rights. Their Lordships unequivocally held that the NCLT, while exercising its powers under Section 60(5)(c) of the IBC, **cannot adjudicate upon disputed questions of title to intellectual property if such determination extends beyond the core scope of the approved resolution plan or the insolvency proceedings.**\n\nHere’s a breakdown of the Court’s key observations and reasoning:\n\n*   **No Blanket Jurisdiction:** The Court clarified that while Section 60(5) of the IBC confers wide powers on the NCLT, it is **not a universal panacea** for all disputes involving a corporate debtor. It does not grant blanket authority to decide every conceivable dispute, especially those which are essentially civil in nature and pre-date the insolvency.\n*   **Contextual Interpretation:** The phrase \"arising out of or in relation to the insolvency resolution or liquidation proceedings\" must be interpreted contextually. If a dispute over trademark ownership involves complex questions of contractual interpretation, the validity of assignments, and principles of trademark law – independent of the immediate insolvency process – then the NCLT is not the appropriate forum.\n*   **Civil Courts, Not Insolvency Fora:** The Supreme Court emphasized that insolvency fora are **not substitutes for civil or commercial courts** that are specifically designed to adjudicate substantive property rights or IP disputes. Such specialized matters require extensive evidence, pleadings, and application of specific statutes like the Trademarks Act, 1999, which fall outside the NCLT's primary mandate of insolvency resolution.\n*   **Resolution Plan's Sanctity:** The Court noted that in the *Gloster* case, the resolution plan itself acknowledged rival claims over the trademark. Therefore, an NCLT order unilaterally declaring title would amount to an **impermissible modification of an approved resolution plan**, which is beyond its powers once the plan has been approved.\n*   **Avoidance Applications:** Another crucial point was regarding avoidance transactions (like preferential, undervalued, or fraudulent transactions under Sections 43, 45, 46, and 66 of the IBC). The Court reiterated that the NCLT cannot invoke these provisions *suo motu* (on its own motion) without a proper application filed by the Resolution Professional, supported by adequate pleadings and evidence. The intricacies of proving such transactions require a formal process, which cannot be bypassed incidentally.\n\nEssentially, the Supreme Court has drawn a clear line in the sand: *NCLT ka kaam insolvency resolution hai, civil property disputes ko decide karna nahi.* (NCLT's job is insolvency resolution, not deciding civil property disputes.)\n\n## Key Takeaways and Implications for Professionals\n\nThis judgment carries significant weight and offers invaluable guidance for Insolvency Professionals (IPs), Resolution Applicants (SRAs), corporate debtors, and legal practitioners:\n\n*   **Clarity on Boundaries:** It clarifies that if a dispute over IP ownership pre-dates the CIRP or is not intrinsically linked to the insolvency process (e.g., challenging a transaction *directly related* to the insolvency under avoidance provisions), then the NCLT should **not** venture into determining title.\n*   **Focused CIRP:** The ruling ensures that the CIRP remains focused on its primary objective: financial resolution of the corporate debtor, rather than becoming a parallel forum for resolving all civil disputes.\n*   **Role of Civil Courts Reinforced:** It reinforces the fundamental principle that specialized civil or commercial courts are the appropriate fora for adjudicating complex intellectual property ownership battles.\n*   **Due Diligence is Paramount:** For Resolution Applicants, this means even more rigorous due diligence regarding the true ownership of IP assets. Don't assume that merely because an asset is listed, its title is undisputed. If rival claims exist and are acknowledged in the resolution plan, be prepared to fight that battle in an appropriate court *outside* the NCLT.\n*   **Strategic Litigation:** Insolvency professionals must be mindful of the limited scope of NCLT's jurisdiction when advising on disputes involving IP. Instead of seeking a declaration of title from the NCLT, the correct strategy would be to advise the SRA or concerned parties to approach a civil court for such adjudication.\n*   **Record Keeping:** This judgment underscores the importance of maintaining clear and unambiguous records of IP ownership and transfer. Ambiguity can lead to protracted litigation, even during insolvency.\n\nThe Supreme Court, in its wisdom, has expressly left open the option for parties to agitate the issue of trademark ownership and the validity of any assignments before the competent civil court or other appropriate forums. This means the \"Gloster\" trademark battle might continue, but in the right court.\n\nIn essence, this judgment is a welcome development that brings much-needed precision to the jurisdictional overlap between insolvency law and intellectual property law. It maintains judicial discipline and ensures that each forum operates within its defined sphere, contributing to a more predictable and efficient legal framework.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://main.sci.gov.in)\n\n*Published on: 31 January 2026*",
  "type": "blog"
}