{
  "id": "supreme-court-puts-a-full-stop-to-creative-gst-refund-modalities-upholds-unjust-enrichment-principle-1771331887643",
  "title": "Supreme Court Puts a Full Stop to Creative GST Refund Modalities, Upholds Unjust Enrichment Principle",
  "slug": "supreme-court-puts-a-full-stop-to-creative-gst-refund-modalities-upholds-unjust-enrichment-principle",
  "date": "17 February 2026",
  "content": "# Supreme Court Puts a Full Stop to Creative GST Refund Modalities, Upholds Unjust Enrichment Principle\n\nAs professionals navigating the intricate world of Goods and Services Tax (GST), we often encounter situations where the law's explicit provisions might seem to clash with equitable considerations. Tax refunds, in particular, have been a hotbed of such discussions. Can a High Court, in its pursuit of justice, craft a refund mechanism that isn't explicitly laid out in the statute? The Supreme Court has recently addressed this critical question, delivering a resounding \"no\" and firmly reinforcing the statutory framework of GST refunds and the indispensable principle of unjust enrichment.\n\nIn a significant pronouncement dated February 10, 2026, in the case of **Union of India & Anr. vs. Torrent Power Ltd.**, the Apex Court clarified, once again, that the **Central Goods and Services Tax Act, 2017 (CGST Act)** provides a complete code for refunds. Any deviation, however well-intentioned, is simply not permissible. This judgment serves as a crucial reminder for all of us – taxpayers, consultants, and authorities alike – about the sanctity of the statutory refund mechanism.\n\n### The Factual Matrix: A Tale of IGST and an 'Alien Modality'\n\nLet's rewind a bit to understand the backdrop. Torrent Power Ltd., engaged in electricity generation and distribution in Gujarat, had collected Integrated GST (IGST) from its consumers on ocean freight, acting under Notification No. 10/2017-Integrated Tax (Rate) dated June 28, 2017. However, this very notification was later declared unconstitutional by the High Court in *Mohit Minerals Pvt. Ltd. vs. Union of India*, a decision subsequently affirmed by the Supreme Court. Naturally, the amounts collected under this invalidated notification became refundable.\n\nHere's where it gets interesting. The company approached the Gujarat High Court, seeking a refund of approximately ₹19.28 crore. The High Court, acknowledging that the tax burden had already been passed on to consumers through tariff fixation, devised a unique solution. It permitted the refund to Torrent Power Ltd. but stipulated that the amount be deposited into a separate bank account and then adjusted through future tariff revisions, thereby aiming to benefit the end-consumers. The High Court believed this would ensure restitution to those who ultimately bore the tax.\n\nThis creative approach, while seemingly fair, was challenged by the Union of India before the Supreme Court.\n\n### Legal Provisions at Play: Section 54 and the Consumer Welfare Fund\n\nThe crux of the matter revolved around **Section 54 of the CGST Act**, which deals with applications for refunds. Specifically, two subsections were central to the Supreme Court's deliberation:\n\n*   **Section 54(5) of the CGST Act**: This provision mandates that any refundable amount, after due verification, shall ordinarily be credited to the **Consumer Welfare Fund (CWF)** referred to in **Section 57 of the CGST Act**. This is the general rule, a clear legislative intent to prevent unjust enrichment.\n*   **Section 54(8)(e) of the CGST Act**: This is an exception to the general rule. It allows the refundable amount to be paid to the applicant (i.e., the taxpayer) *only if* the incidence of such tax has *not* been passed on to any other person. In simpler terms, if *aapki jeb se paisa gaya hai*, only then will it come back to your pocket.\n\nThe **Doctrine of Unjust Enrichment** is foundational to these provisions. It's a legal principle preventing someone from unfairly benefiting at another's expense. In indirect taxation, it means a taxpayer cannot claim a refund if they have already recovered the tax from their customers.\n\n### The Apex Court's Decisive Ruling: No Shortcuts to Refunds\n\nThe Supreme Court, after hearing both sides, unequivocally set aside the Gujarat High Court's judgment. The Apex Court held that the High Court had erred in devising a refund mechanism that was not contemplated under Section 54 of the CGST Act and the Rules framed thereunder. It termed the High Court's procedure an \"altogether alien modality for disbursal of a refund.\"\n\nHere's why the Supreme Court rejected the High Court's approach:\n\n*   **Statutory Supremacy**: The Court emphasized that the refund mechanism under Section 54 of the CGST Act is a complete code. Courts cannot introduce alternative modalities for refund disbursal when the statute prescribes a specific procedure. *Kanoon jo kehta hai, wahi chalega*.\n*   **Unjust Enrichment Confirmed**: It was an admitted fact that Torrent Power Ltd. had passed on the incidence of tax collected under the invalidated notification to its consumers through tariff adjustments. Therefore, the exception under Section 54(8)(e) allowing direct refund to the applicant did not apply. The money, having been collected from consumers, rightfully belonged to the Consumer Welfare Fund.\n*   **Impracticality of the Proposed Mechanism**: The Supreme Court also noted the sheer impracticality and unworkability of the High Court's suggested method. Imagine identifying and recompensing over a crore consumers spread across two cities. It would be a gargantuan and unworkable exercise to verify whether the actual burden-bearers received the benefit. *Yeh toh mushkil hi nahi, namumkin hai!*\n\nConsequently, the Supreme Court directed Torrent Power Ltd. to transfer the disputed amount of ₹19.28 crore to the authorities concerned, to be credited to the **Consumer Welfare Fund** within a period of three months.\n\n### Key Takeaways for Businesses and Professionals\n\nThis judgment from the Supreme Court is not just about a specific case; it's a critical affirmation of fundamental principles governing GST refunds in India:\n\n*   **Statutory Route is Paramount**: Any claim for a GST refund must strictly adhere to the procedures and conditions laid down in **Section 54 of the CGST Act** and its associated rules. There is no scope for courts or taxpayers to invent new mechanisms.\n*   **Unjust Enrichment – A Formidable Barrier**: The doctrine of unjust enrichment is a robust gatekeeper for refunds. Unless a taxpayer can conclusively demonstrate that they have borne the incidence of tax and have not passed it on to consumers, the refund will be directed to the Consumer Welfare Fund. Maintaining meticulous records to prove that the tax burden was not passed on is crucial.\n*   **Consumer Welfare Fund's Role**: The Consumer Welfare Fund plays a vital role in ensuring that public money collected as tax, where the burden has been shifted, ultimately benefits the consumers indirectly, rather than unjustly enriching businesses.\n*   **Proactive Compliance**: Businesses must be acutely aware of the implications of passing on tax incidence. In scenarios of invalidated levies, the immediate reaction should be to assess whether the unjust enrichment principle applies.\n\nThis judgment provides much-needed clarity, reinforcing the legal framework of GST refunds. It reminds us that while equity is important, it must operate within the confines of the established law. For us Chartered Accountants and legal analysts, this means advising our clients with renewed emphasis on strict compliance with Section 54 and the robust application of the unjust enrichment doctrine.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://main.sci.gov.in/latest-orders)\n\n*Published on: 17 February 2026*",
  "type": "blog"
}