{
  "id": "supreme-court-to-delve-into-30month-itr-delay-a-deep-dive-for-tax-professionals-1771418257669",
  "title": "Supreme Court to Delve Into 30-Month ITR Delay: A Deep Dive for Tax Professionals",
  "slug": "supreme-court-to-delve-into-30month-itr-delay-a-deep-dive-for-tax-professionals",
  "date": "18 February 2026",
  "content": "# Supreme Court to Delve Into 30-Month ITR Delay: A Deep Dive for Tax Professionals\n\nAlright, my fellow tax professionals, let's talk about something that hits close to home for many of us and our clients: the ever-present challenge of Income Tax Return (ITR) filing delays. We all know how critical deadlines are, yet life, and sometimes business realities, can throw a spanner in the works. The Supreme Court has recently taken up a case that could significantly shape how 'condonation of delay' under the Income Tax Act is viewed, especially for substantial delays. This is definitely something to keep an eye on, aur samjhna zaroori hai.\n\nOn February 10, 2026, the Supreme Court of India issued notice in a significant Special Leave Petition (SLP) concerning a whopping 30-month delay in ITR filing. The core question before the apex court is whether the Income Tax Department can condone such an extensive delay. This isn't just another routine case; it's an opportunity for the Supreme Court to lay down clearer principles on what constitutes \"sufficient cause\" and \"genuine hardship\" in the context of delayed ITR submissions, particularly when substantial financial implications are at stake.\n\n## The Case at Hand: M/s Sirez Limited v. Union of India\n\nThe matter originates from a Special Leave Petition filed by M/s Sirez Limited (also referred to as Sirez Limited). The company had delayed filing its Income Tax Return for Assessment Year 2018-19 by 30 months. Consequently, this delay led to the denial of crucial benefits: the carry forward of business loss amounting to ₹1,06,60,750 and a TDS refund of ₹19,73,540.\n\nNow, why the delay? The petitioner attributed it to \"inter se disputes amongst the directors and a financial crunch.\" However, the Delhi High Court, in its earlier judgment, had dismissed the writ petition, taking a firm stance. The High Court observed that \"internal dispute among the Directors of the company is not a genuine hardship, which can be the ground on which the delay can be condoned.\" It further noted the absence of documentary evidence to substantiate extraordinary circumstances and stated that allowing such condonation would lead to a \"vast expansion of the term 'genuine hardship'.\"\n\nThis brings us to the Supreme Court's involvement. A bench comprising Justice J.B. Pardiwala and Justice K.V. Viswanathan issued notice in the SLP on February 10, 2026. The Court specifically noted that the \"short point\" for its consideration is \"whether delay in filing the Return of income can be condoned under Section 119(2)(b) of the Act, 1961.\" The case has been listed for further hearing on March 9, 2026.\n\n## The Legal Provisions: Understanding Section 119(2)(b)\n\nThis entire discussion hinges on **Section 119(2)(b) of the Income Tax Act, 1961**. Let's quickly recap what this section entails:\n\n*   **Empowering the CBDT:** Section 119 broadly empowers the Central Board of Direct Taxes (CBDT) to issue instructions and directions to income tax authorities.\n*   **Condonation Power:** Specifically, Section 119(2)(b) grants the CBDT the authority to admit an application or claim for refund, or for carry forward and set-off of loss, even after the expiry of the prescribed time limit. This power is exercised to avoid genuine hardship to taxpayers.\n*   **Conditions for Condonation:** The CBDT has, from time to time, issued circulars outlining the conditions and procedures for condonation of delay. Generally, the tax authorities must be satisfied that the taxpayer was prevented by \"reasonable cause\" from filing within the due date and that the case involves \"genuine hardship.\" Tax authorities are also empowered to conduct inquiries to ascertain the merits of such applications.\n*   **Discretionary, Not a Right:** It's crucial to remember that condonation of delay is a discretionary power, not a right that a taxpayer can claim. The underlying principle is to ensure that procedural requirements serve justice, rather than hindering it, for genuine cases.\n\nThe Supreme Court's examination in the Sirez Limited case will likely scrutinize the interpretation and application of \"genuine hardship\" under Section 119(2)(b), especially when the reasons cited for delay are internal corporate disputes.\n\n## What Does This Mean for Professionals?\n\nThe Supreme Court's decision to examine this case, even if it's currently only at the \"notice issued\" stage, sends a clear signal. It reinforces the importance of **timely compliance** but also acknowledges the need for a mechanism to address genuine difficulties.\n\n1.  **Revisiting \"Genuine Hardship\":** The outcome of this case will be a significant precedent for what constitutes \"genuine hardship\" in future applications for condonation of delay. Will internal squabbles within a company be considered a valid enough reason to excuse a 30-month delay in statutory compliance? The Delhi High Court said no, and the Supreme Court will now weigh in.\n2.  **Emphasis on Documentation:** The High Court's observation about the lack of documentary evidence is a sharp reminder. If you're seeking condonation, the onus is heavily on the taxpayer to provide robust, verifiable proof of the circumstances that led to the delay. Simply stating a reason won't cut it; you need to back it up with solid evidence.\n3.  **Proactive Compliance is Key:** While condonation provisions offer a safety net, relying on them should always be a last resort. The best practice, as always, is meticulous and proactive compliance. Jab tak ho sake, due dates adhere karna hi sabse accha tareeka hai.\n4.  **Impact on Loss Carry Forward & Refunds:** This case directly impacts the ability to claim vital tax benefits like loss carry-forward and refunds when ITRs are filed late. The Supreme Court's interpretation will have far-reaching consequences for businesses and individuals facing similar situations.\n\nThis situation highlights the delicate balance the judiciary maintains between enforcing strict tax compliance and providing relief in truly deserving cases. We have already seen the CBDT issue new guidelines in recent years to streamline condonation applications, including monetary limits for various authorities and a five-year time limit for submitting applications (with exceptions for court orders). This Supreme Court intervention will further refine the legal landscape.\n\n## Conclusion\n\nThe Supreme Court's decision to examine the 30-month delay in ITR filing by M/s Sirez Limited is a pivotal development. It underscores the judiciary's role in interpreting the nuances of tax law, particularly the application of Section 119(2)(b) and the concept of \"genuine hardship.\" For us as tax professionals, this is a crucial reminder to emphasize stringent compliance, meticulous documentation for any delays, and a realistic assessment of what the courts might consider a \"sufficient cause.\" The final verdict, when it comes, will undoubtedly provide much-needed clarity and set a precedent for years to come.\n\n## Read the Official Document\n*   [Search for the Supreme Court's Orders and Judgments here](https://main.sci.gov.in/judgement-date)\n\n*Published on: 18 February 2026*",
  "type": "blog"
}