{
  "id": "supreme-courts-landmark-verdict-when-shares-in-amalgamation-become-business-profits-under-section-28-1768047681766",
  "title": "Supreme Court's Landmark Verdict: When Shares in Amalgamation Become Business Profits Under Section 28!",
  "slug": "supreme-courts-landmark-verdict-when-shares-in-amalgamation-become-business-profits-under-section-28",
  "date": "10 January 2026",
  "content": "# Supreme Court's Landmark Verdict: When Shares in Amalgamation Become Business Profits Under Section 28!\n\nCorporate amalgamations – a strategic move for growth, consolidation, or sometimes, just survival. But for us chartered accountants and legal analysts, every amalgamation brings with it a complex web of tax implications. One perennial question that has often left professionals scratching their heads, and has been a hotbed of litigation, is the taxability of shares received by an assessee in an amalgamated entity. Are they capital assets, or do they get treated as business profits? Well, the Supreme Court has finally brought much-needed clarity on this critical issue with its judgment dated January 9, 2026. This is a game-changer, folks!\n\n### The Background: A Common Conundrum for Corporate India\n\nLet's be honest, the distinction between a 'capital asset' and 'stock-in-trade' can often feel like a grey area, especially when shares are involved. For years, companies undergoing amalgamation, particularly those holding shares of the amalgamating entity as **stock-in-trade**, faced significant challenges from the tax department. The revenue authorities often sought to tax the value of shares received in the amalgamated company as **business profits** under **Section 28** of the Income Tax Act, 1961. Assessees, on the other hand, typically argued for exemption, contending that the substitution of shares in an amalgamation should not trigger a taxable event, especially under **Section 47(vii)** which provides for non-taxability of transfer of shares in certain amalgamations if they are capital assets. *Yeh toh pura mamla pechida ho jaata tha!*\n\nThe recent batch of petitions before the Apex Court involved a long-standing dispute, notably concerning investment companies of the Jindal Group. The core issue stemmed from a scenario where the assessees held shares of one company (e.g., Jindal Ferro Alloys Limited - JFAL) as stock-in-trade, which subsequently amalgamated with another (e.g., Jindal Strips Limited - JSL). Upon amalgamation, the shareholders of JFAL received shares of JSL in lieu of their original holdings. The tax department, treating these as stock-in-trade, attempted to tax the difference in value as business income under Section 28, rejecting claims of exemption under Section 47(vii). This set the stage for the Supreme Court to finally draw a clear line.\n\n### Delving into the Legal Provisions: Section 28 vs. Capital Gains\n\nTo appreciate the Supreme Court's pronouncement, it's essential to briefly revisit the relevant provisions:\n\n*   **Section 28 of the Income Tax Act, 1961 (ITA):** This is the charging section for \"profits and gains of business or profession.\" It broadly covers income derived from any business or profession, irrespective of whether it's received in cash or kind.\n*   **Section 45 of the ITA:** This section deals with \"capital gains,\" where profits or gains arising from the transfer of a capital asset are chargeable to income tax.\n*   **Section 47(vii) of the ITA:** This section provides specific exemptions for certain transfers. Specifically, it states that any transfer by a shareholder of shares held by him in the amalgamating company in consideration of the allotment to him of any share or shares in the amalgamated company shall not be regarded as a transfer for the purpose of capital gains. *However, this exemption primarily applies when the shares are capital assets.*\n\nThe core legal question was whether the *substitution* of shares in an amalgamation, when the original shares were held as *stock-in-trade*, constitutes a \"realisation\" of profit that is taxable as business income under Section 28, or if it falls outside the ambit of \"transfer\" and hence, outside the tax net for business profits too.\n\n### The Supreme Court's Landmark Clarification: The \"Realisability\" Test\n\nIn its pivotal judgment dated January 9, 2026, the Supreme Court, through a bench comprising Justice J.B. Pardiwala and Justice R. Mahadevan, unequivocally clarified the taxability of shares received in an amalgamation, particularly when they were originally held as stock-in-trade. The Court observed that the receipt of shares of the amalgamated company in substitution of shares held as **stock-in-trade** can indeed give rise to **taxable business profits** under Section 28.\n\nHowever, and this is the crucial part, such taxability is **not automatic**. The Court introduced and emphasized the \"Doctrine of Real Income,\" stipulating that the profit must be \"real and presently realisable\". The substitution of shares in an amalgamation is not a \"mere neutral replacement\". If the new shares are freely marketable and possess a definite commercial value, this event constitutes a \"commercial realisation\" leading to taxable business income.\n\nThe Apex Court laid down a clear **three-pronged test** to determine taxability under Section 28 in such situations:\n1.  **Cessation of Old Stock-in-Trade:** The shares held as old stock-in-trade must cease to exist.\n2.  **Definite Market Value:** The newly allotted shares of the amalgamated company must possess a definite market value.\n3.  **Free Tradability:** The assessee must be in a position to immediately dispose of such new shares, implying they must be freely tradable.\n\nFurthermore, the Court clarified the **timing of the taxable event**. The charge under Section 28 is attracted **only upon the allotment of the new shares**, when the statutory substitution translates into a concrete, realisable commercial advantage. It is not triggered merely on the sanction of the amalgamation scheme by the court or on the appointed date.\n\nThe judgment also highlighted that Section 28 is a comprehensive charging provision designed to capture all real profits arising in the course of business, whether received in cash or in kind. It is \"agnostic to the mode of realisation,\" distinguishing it from Section 45, which is more focused on the definition of \"transfer\". The Court implicitly closed a potential avenue for tax planning (or *tax jugad*, as some might call it) where traders could convert stock-in-trade without immediate tax incidence.\n\nWhile affirming the principle of law, the Supreme Court prudently remanded the specific case back to the Income Tax Appellate Tribunal (ITAT) for a factual determination. The ITAT will now need to ascertain whether the shares in question were indeed held as stock-in-trade and if they were, in fact, freely realisable and tradable upon allotment to justify the levy of tax under Section 28.\n\n### Practical Implications for Businesses and Professionals\n\nThis judgment carries significant weight for corporate restructuring exercises and how businesses maintain their books of accounts.\n\n*   **Re-evaluation of Shareholdings:** Companies holding shares in other entities, particularly as part of their trading portfolio, must now carefully evaluate the tax implications during any amalgamation process. The 'nature' of holding (investment vs. stock-in-trade) will be paramount.\n*   **Documentation is Key:** Proper documentation clearly demarcating shares held as investments and those as stock-in-trade will become even more critical. *Bina proper paperwork ke, it can become a headache!*\n*   **Valuation Challenges:** Determining the \"definite market value\" and \"realisability\" of the new shares at the time of allotment could be a point of contention and require robust valuation reports.\n*   **Advance Tax Implications:** If shares received in amalgamation meet the three-pronged test, companies will need to factor in the potential business profit and associated advance tax liabilities at the time of allotment.\n*   **Distinction between Sections:** The judgment reinforces the fundamental difference between the scope of business income (Section 28) and capital gains (Section 45). While Section 47(vii) protects capital assets in amalgamations, it does not provide an automatic shield for stock-in-trade.\n\n### Concluding Thoughts\n\nThe Supreme Court's judgment on January 9, 2026, provides much-needed clarity on a contentious issue that has plagued tax litigation for years. By clearly outlining the conditions under which shares received in amalgamation, if held as stock-in-trade, will be taxed as business profits under Section 28, the Apex Court has ensured that real commercial advantages arising from such transactions do not escape the tax net. This ruling is a crucial step towards streamlining the tax treatment of corporate restructuring and emphasizes the \"Doctrine of Real Income.\" As professionals, it's *ab hamari zimmedari hai* to guide our clients through these nuanced implications and ensure compliance.\n\n## Read the Official Document\n*   [Judgments - Supreme Court of India](https://main.sci.gov.in/judgments)\n\n*Published on: 10 January 2026*",
  "type": "blog"
}