{
  "id": "agency-banks-to-operate-on-march-31-2026-despite-mahavir-janmakalyanak-holiday-1770945426209",
  "title": "Agency Banks to Operate on March 31, 2026, Despite Mahavir Janmakalyanak Holiday",
  "slug": "agency-banks-to-operate-on-march-31-2026-despite-mahavir-janmakalyanak-holiday",
  "date": "13 February 2026",
  "content": "# Agency Banks to Operate on March 31, 2026, Despite Mahavir Janmakalyanak Holiday\n\nEk important update hai! Government ne agency banks ke liye March 31, 2026, ko operations maintain karne ka announcement kiya hai, even though it's a public holiday on account of Mahavir Janmakalyanak. This move is crucial for year-end financial activities.\n\n*   **What's the update?** All agency banks dealing with Government receipts and payments are required to remain open for transactions on March 31, 2026.\n*   **Why is this happening?** The Government of India has requested this to ensure that all government transactions related to receipts and payments for the Financial Year 2025-26 are processed, reported, and accounted for within the same fiscal year. This is vital for determining the correct cash balance of the Government of India as of March 31, 2026.\n*   **Previous Status:** March 31, 2026, was previously listed as a public holiday in several states for Mahavir Janmakalyanak (Mahavir Jayanti), meaning banks would typically be closed in those regions.\n*   **Official Directive:** This instruction comes via Office Memorandum No. R-08/4/2024-GBA-CGA/886-918, dated February 12, 2026, issued by the Controller General of Accounts (CGA), Ministry of Finance, Department of Expenditure. The Reserve Bank of India (RBI) had also advised agency banks to comply.\n*   **Action for Banks:** Agency banks are requested to make necessary arrangements to facilitate government business on this day and also publicize the availability of banking services.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://cga.nic.in/)\n    *(Please navigate to the \"Orders / Circulars\" or \"What's New\" section on the homepage to find the relevant Office Memorandum No. R-08/4/2024-GBA-CGA/886-918 dated February 12, 2026.)*\n\n*Published on: 13 February 2026*",
  "type": "update"
}