{
  "id": "cbdt-urges-taxpayers-review-ineligible-deductionexemption-claims-for-ay-202526-by-december-31-2025-1766579061878",
  "title": "CBDT Urges Taxpayers: Review Ineligible Deduction/Exemption Claims for AY 2025-26 by December 31, 2025",
  "slug": "cbdt-urges-taxpayers-review-ineligible-deductionexemption-claims-for-ay-202526-by-december-31-2025",
  "date": "24 December 2025",
  "content": "# CBDT Urges Taxpayers: Review Ineligible Deduction/Exemption Claims for AY 2025-26 by December 31, 2025\n\nEk important update hai taxpayers ke liye! The Central Board of Direct Taxes (CBDT) ne ek naya initiative announce kiya hai, jismein taxpayers ko encourage kiya ja raha hai ki woh voluntarily apne ineligible deduction aur exemption claims ko review karein, especially for Assessment Year (AY) 2025-26.\n\nHere’s a quick lowdown on what you need to know:\n\n*   **What's the Deal?** CBDT has launched a \"Non-intrusive Usage of Data to Guide and Enable (NUDGE)\" campaign. Ismein identified taxpayers ko SMS aur email ke through bola ja raha hai ki woh apne Income-tax Returns (ITRs) mein claimed deductions aur exemptions ko review karein, jo risk analytics ke through potentially ineligible identified hue hain.\n*   **Why the Review?** Department ne observe kiya hai ki kuch taxpayers ne aise deductions aur exemptions claim kiye hain jinke liye woh eligible nahi the, leading to understatement of income and ineligible refunds.\n*   **Common Issues:** Specifically, ismein cases like bogus donations to Registered Unrecognised Political Parties (RUPPs), incorrect ya invalid PANs of donees, aur claimed amounts mein discrepancies shaamil hain.\n*   **Deadline for Correction:** Agar koi discrepancy milti hai, toh taxpayers ko advised hai ki woh apne revised ITRs **December 31, 2025** tak file kar dein.\n*   **Genuine Claims? No Worries!** Agar aapke deduction ya exemption claims genuine hain aur law ke according correct hain, toh aapko koi action lene ki zaroorat nahi hai.\n*   **Missed Deadline?** Agar aap 31st December, 2025 tak revise nahi kar paate, toh aap January 1, 2026 se updated return file kar sakte hain, but ismein additional tax liability lag sakti hai.\n\nThis initiative shows a \"trust-first\" approach from the tax administration, aiming to promote voluntary compliance and self-correction.\n\n## Read the Official Document\n*   [Download the Official Press Release here](https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFTS5ngqP_fN7wMrJ8t_wjVIWl4p5dNVD9I45zC-iX4MKuN8qb_NvG06smprmHX4k10YiDo-Bt-25ic7QasnAUJ3GVEDB6DuobUr5MTwAc_y22fEqTf91E-lpkWOVQsPDI9CML0oP-9C9RTo0_FIpeqMMIVEFlkzh0x3gogs54Iqr9gWg==)\n\n*Published on: 24 December 2025*",
  "type": "update"
}