{
  "id": "cbic-issues-advisory-on-hsns-cess-login-and-payment-procedures-1769776373936",
  "title": "CBIC Issues Advisory on HSNS Cess Login and Payment Procedures",
  "slug": "cbic-issues-advisory-on-hsns-cess-login-and-payment-procedures",
  "date": "30 January 2026",
  "content": "# CBIC Issues Advisory on HSNS Cess Login and Payment Procedures\n\nEk important update hai! Government ne Health Security se National Security (HSNS) Cess ke liye registration aur payment procedure announce kiya hai. CBIC ne Advisory No. 01/2026 dated January 28, 2026, publish ki hai, jo taxpayers ko naye cess ke compliance ke baare mein guide karti hai. HSNS Cess Act, 2025, jo 16.12.2025 ko notify hua tha, 01.02.2026 se effective ho raha hai.\n\n**Key Highlights of the Advisory:**\n\n*   **Portal Launch:** HSNS Cess application functionalities, jismein login, enrollment, new registration aur payment shamil hain, CBIC ke designated portal (www.cbic-gst.gov.in) par 01.02.2026 se functional ho jayenge.\n*   **Registration Process:** Naye applicants ko portal par \"HSNS (Cess) Login\" section mein jaakar \"New Registration\" select karna hoga. Unhe PAN-based details, mobile number, email ID, aur state of business location provide karni hogi. PAN verification Income Tax portal ke through hoga, jiske baad ek OTP se verification karke 15-digit alphanumeric Enrollment Reference Number (ERN) generate hoga. Iss ERN aur OTP se login karke HSNS REG-01 form fill karna hoga.\n*   **Payment Procedure:**\n    *   Taxpayers ko existing user ID aur password se portal par login karna hoga.\n    *   \"E-Payment\" menu ke under, \"HSNS- Generate Challan\" option choose karna hoga.\n    *   System taxpayer details auto-display karega.\n    *   Appropriate accounting code select karna hoga; Major Accounting Head code 0045 HSNS Cess payment ke liye allot kiya gaya hai. Ismein Cess on Pan Masala, Interest (if any) & Penalty (if any) ke liye codes shamil hain.\n    *   Payment challans (Form HSNS PMT-01) electronically generate aur track kiye ja sakte hain.\n*   **Due Dates:** Monthly cess ka payment electronically har mahine ki 7th tarikh tak karna hoga. Monthly return (FORM HSNS RET-01) succeeding month ki 20th tarikh tak furnish karna hoga.\n*   **Helpdesk:** CBICMITRA Helpdesk HSNS Cess users ko support karega. Queries cbicmitra.helpdesk@icegate.gov.in ya toll-free number 1800-425-0232 par address ki ja sakti hain.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.cbic-gst.gov.in/pdf/Advisory%20No.%2001-2026%20-%20HSNS%20Cess.pdf)\n\n*Published on: 30 January 2026*",
  "type": "update"
}