{
  "id": "icai-introduces-stricter-transparency-rules-for-internationally-affiliated-audit-firms-1772195743484",
  "title": "ICAI Introduces Stricter Transparency Rules for Internationally Affiliated Audit Firms",
  "slug": "icai-introduces-stricter-transparency-rules-for-internationally-affiliated-audit-firms",
  "date": "27 February 2026",
  "content": "# ICAI Introduces Stricter Transparency Rules for Internationally Affiliated Audit Firms\n\nEk important update hai! The Institute of Chartered Accountants of India (ICAI) ne recently \"ICAI (Global Networking) Guidelines, 2025\" announce kiye hain, jisse internationally affiliated audit firms ke liye transparency aur regulatory compliance badh gayi hai. Yeh move Indian audit profession ko strengthen karne aur global collaborations ke liye ek clear framework provide karne ke liye hai.\n\n**Key Highlights of the New Guidelines:**\n\n*   **Mandatory Registration:** All arrangements between Indian CA firms and overseas accounting networks must now be mandatorily registered with the ICAI.\n*   **Nodal Officer Appointment:** Each Global Network registered with ICAI will need to designate a \"Nodal Officer cum Contact Person.\" Yeh officer network ki compliance requirements ko ensure karne ke liye responsible honge.\n*   **Annual Filings:** Global Networks ko har financial year-end ke 120 din ke andar Form 'DGN' mein annual return file karna hoga. Ismein capital structure, revenue sharing, disciplinary proceedings, aur domestic & overseas constituents ke beech payments ki detailed information deni hogi.\n*   **Arm's Length Dealings:** Domestic entities aur foreign entities ke beech sabhi dealings 'arm's length basis' par honi chahiye, ensuring fairness aur independence.\n*   **Ethical and Compliance Standards:** Indian CA firms ko ICAI ke Code of Ethics aur Indian laws, including data protection regulations, ka poori tarah se palan karna hoga, even while in international collaborations.\n*   **Existing Networks:** Jo firms already international networks ka part hain, unhe guidelines लागू hone ki date se 180 din ke andar registration ke liye apply karna hoga.\n*   **Prohibition on Fee/Profit Sharing:** Non-members ke saath fee ya profit sharing allowed nahin hai, jaisa ki ICAI Code of Ethics aur Chartered Accountants Act, 1949 mein stipulated hai.\n\nYeh guidelines 11th February 2026 ko Official Gazette mein publish kiye gaye the. Inka main aim hai ki Indian audit firms global level par compete kar saken while maintaining high standards of transparency, independence, aur regulatory oversight.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.icai.org/)\n\n*Published on: 27 February 2026*",
  "type": "update"
}