{
  "id": "icai-confirms-new-tax-audit-limit-of-60-audits-per-partner-from-april-2026-1769216269620",
  "title": "ICAI Confirms New Tax Audit Limit of 60 Audits Per Partner from April 2026",
  "slug": "icai-confirms-new-tax-audit-limit-of-60-audits-per-partner-from-april-2026",
  "date": "24 January 2026",
  "content": "# ICAI Confirms New Tax Audit Limit of 60 Audits Per Partner from April 2026\n\nEk important update hai! The Institute of Chartered Accountants of India (ICAI) ne Tax Audit assignments ki limit ko lekar naye guidelines announce kiye hain. These new rules aim to enhance audit quality and streamline professional practice.\n\n*   **Old vs. New Limit:** While the overall limit of 60 tax audit assignments per member in practice was already existing, the new guidelines explicitly state that this limit will now apply **per partner** in a CA firm. This means pooling or sharing of limits among partners will not be allowed.\n*   **Effective Date:** Yeh naye guidelines **April 1, 2026** se effective honge, yaani Assessment Year 2026-27 onwards ke audits par apply honge.\n*   **Notification Details:** ICAI ne yeh guidelines **Notification No. F. No. 1-CA(7)/234/2025** ke through issue kiye hain, dated **July 25, 2025**.\n*   **Key Clarifications:**\n    *   The limit of 60 will be an aggregate for all tax audits signed by a member, whether in individual capacity or as a partner in one or more firms.\n    *   Certain tax audit assignments, specifically those under clauses (c), (d), and (e) of Section 44AB (related to presumptive taxation schemes like 44AD, 44ADA, and 44AE), will **not** be counted towards this limit.\n    *   Revised tax audit reports will also not be counted separately for the purpose of this limit.\n    *   Head office and branch office audits of the same entity will be considered as a single assignment.\n\nYeh move professional diligence ensure karne aur audit efficacy badhane ke liye kiya gaya hai.\n\n## Read the Official Document\n*   [Download the Official Notification here](https://egazette.nic.in/WriteReadData/2025/258.pdf)\n\n*Published on: 24 January 2026*",
  "type": "update"
}