{
  "id": "icsi-council-meeting-key-decisions-from-january-11-2026-1768784594471",
  "title": "ICSI Council Meeting: Key Decisions from January 11, 2026",
  "slug": "icsi-council-meeting-key-decisions-from-january-11-2026",
  "date": "19 January 2026",
  "content": "# ICSI Council Meeting: Key Decisions from January 11, 2026\n\nEk important update hai. The Institute of Company Secretaries of India (ICSI) ne apni Council Meeting mein kuch significant decisions announce kiye hain. Yeh decisions January 11, 2026 ko hui meeting mein liye gaye the aur January 18, 2026 ko publish kiye gaye hain.\n\nYahaan kuch important highlights hain:\n\n*   **Strategic Action Plan 2026-2030 Adopted:** Council ne Institute ka Strategic Action Plan (2026-2030) adopt kar liya hai. Ismein internal organizational re-structuring aur re-alignment shamil hai taaki stakeholders ko better services mil saken.\n*   **Organizational Structure & Governance:**\n    *   Revised Organizational Structure for various Directorates at ICSI approved.\n    *   Committees of the Council ka consolidation aur Revised Guidelines for Good Council Practices ko bhi approval mila hai.\n    *   ICSI Code of Conduct and Ethics for Council Members and Senior Management bhi revise kiya gaya hai.\n*   **Regional Strengthening:** Regional Offices and Chapters ko strengthen karne aur ICSI Headquarters se activities ka de-centralization karne par bhi focus rahega.\n*   **Key Proposals (In-Principle Approvals):**\n    *   Various Guidelines of the Institute ko consolidate karne ka in-principle approval mila hai.\n    *   Company Secretaries in Practice ke liye Regulatory Framework ko liberalize karne ka bhi in-principle approval diya gaya hai.\n    *   ICSI Service Rules, 1979 mein amendments aur Institute ki ESG Policy frame karne ka bhi in-principle approval mila hai.\n*   **National Programmes Rationalized:** Ab se, National Convention of Company Secretaries, National Conference of Practicing Company Secretaries aur ICSI National Awards for Excellence on Corporate Governance hi Institute ke only National Programmes honge.\n*   **Student Study Material Dispatch:** Executive Programme students ko registration fee milne ke baad hi study materials dispatch kar diye jaayenge, irrespective of document verification ya candidate ki non-eligibility. Isse early delivery ensure hogi.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEwxNMJYrfdDuzexCgG3b8-6cBrk3RBTIlsuvS0kcV3tgG2hb_WuqljH1dftlzbYYhxnLXSu1dFmBfBxeFkIcrYH7vRgpQQevSxmk4HzNwLAfwf4svLmhFM7a2T5KA2UnzDqt-75fNucAXl3X_YUbd4InceMqKRAB9_S3MD0fGwSCt49D3Mbna5771G)\n\n*Published on: 19 January 2026*",
  "type": "update"
}