{
  "id": "important-update-sebi-amends-regulations-for-nonconvertible-securities-1769130040799",
  "title": "Important Update: SEBI Amends Regulations for Non-Convertible Securities",
  "slug": "important-update-sebi-amends-regulations-for-nonconvertible-securities",
  "date": "23 January 2026",
  "content": "# Important Update: SEBI Amends Regulations for Non-Convertible Securities\n\nEk important update hai for all Chartered Accountants and market participants! The Securities and Exchange Board of India (SEBI) ne Non-Convertible Securities ki Issue aur Listing ke liye naye amendments announce kiye hain.\n\nThese amendments, notified on January 21, 2026, aim to further develop the corporate debt market and increase retail investor participation.\n\nHere are the key highlights from the **SEBI (Issue and Listing of Non-Convertible Securities) (Amendment) Regulations, 2026** (Notification No. SEBI/LAD-NRO/GN/2026/296, dated January 20, 2026):\n\n*   **Incentives for Investors:** Ab debt issuers ko permit kiya gaya hai ki woh certain categories ke investors ko additional interest ya issue price par discount ke form mein incentives offer kar sakte hain.\n*   **Targeted Investor Categories:** Yeh incentives senior citizens, women, serving and retired defence personnel, widows and widowers of defence personnel, aur retail individual investors ko mil sakte hain. SEBI future mein additional categories bhi specify kar sakti hai.\n*   **Revised Definition of Retail Individual Investor:** Regulations mein \"retail individual investor\" ki ek revised definition add ki gayi hai. Iske according, retail individual investor woh individual hai jo debt securities ke liye ₹2 lakh tak apply ya bid karta hai.\n*   **Restriction on Incentives:** Yeh important hai ki yeh incentives sirf initial allottee tak hi limited rahenge. Agar securities baad mein transfer hoti hain, toh yeh incentives unpar apply nahi honge.\n*   **Objective:** In changes ka main objective corporate debt market mein retail investors ki involvement badhana aur public issuances ko encourage karna hai.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.sebi.gov.in/legal/regulations.html)\n\n*Published on: 23 January 2026*",
  "type": "update"
}