{
  "id": "important-update-icai-opens-empanelment-for-may-2026-ca-exam-observers-1771290721139",
  "title": "Important Update: ICAI Opens Empanelment for May 2026 CA Exam Observers",
  "slug": "important-update-icai-opens-empanelment-for-may-2026-ca-exam-observers",
  "date": "17 February 2026",
  "content": "# Important Update: ICAI Opens Empanelment for May 2026 CA Exam Observers\n\nEk important update hai for all ICAI members! The Institute of Chartered Accountants of India (ICAI) ne May 2026 CA Examinations ke liye Observers act karne ke liye members ki empanelment process announce ki hai. This is a great opportunity for members to contribute to the examination process.\n\nHere are the key details you need to know:\n\n*   **Application Window:** Interested members can apply for empanelment to act as observers for the upcoming May 2026 CA Examinations. The last date to apply is March 19, 2026.\n*   **Eligibility Criteria:**\n    *   Applicants should not be more than 65 years of age as on February 20, 2026.\n    *   Their name must have been on the Register of Members as on November 1, 2023, and should continue to be so.\n    *   Neither the applicant nor their relatives or dependents should be appearing in the May 2026 CA Examinations.\n    *   Applicants should not be involved in coaching students for any ICAI examinations.\n    *   There should be no conviction by any court of law and no disciplinary proceedings pending against them.\n    *   They should not be associated with the Institute as an elected/co-opted member of the Council / Regional Council / Managing Committee of any Branch of the ICAI.\n*   **Cooling Off Period:** A cooling-off period of one attempt will be applicable after three consecutive observership duties.\n*   **Application Process:** Members desirous of empaneling themselves can apply online through the Observer Portal.\n*   **Honorarium:** Observers will receive an honorarium of Rs. 3750 per day/per session, along with conveyance reimbursement (Rs. 500 for 'A' class cities and Rs. 400 for other cities per day).\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.icai.org/category/important-announcements)\n\n*Published on: 17 February 2026*",
  "type": "update"
}