{
  "id": "important-update-india-and-france-amend-dtaa-1771895434258",
  "title": "Important Update: India and France Amend DTAA",
  "slug": "important-update-india-and-france-amend-dtaa",
  "date": "24 February 2026",
  "content": "# Important Update: India and France Amend DTAA\n\nEk important update hai! Government of India aur Government of the French Republic ne apne Double Taxation Avoidance Convention (DTAC) ko amend karne ke liye ek Protocol sign kiya hai, dated February 23, 2026. Is amendment se tax certainty badhegi aur India aur France ke beech investment aur economic relationships ko boost milega.\n\nHere are the key changes introduced by this Amending Protocol:\n\n*   **Capital Gains on Shares:** Ab capital gains jo company ke shares ki sale se arise honge, unpar taxing rights us jurisdiction ko milenge jahan company resident hai.\n*   **Most-Favoured-Nation (MFN) Clause Removal:** DTAC ke Protocol se MFN Clause ko delete kar diya gaya hai, jisse iske interpretation aur application se related long-standing disputes ab settle ho jayenge.\n*   **Dividend Taxation:** Dividend income par single rate of 10% ki jagah ab split rates apply honge:\n    *   5% tax rate un shareholders ke liye jo company ke capital ka at least 10% hold karte hain.\n    *   15% tax rate for all other cases.\n*   **Fees for Technical Services (FTS):** FTS ki definition ko India-US Double Taxation Avoidance Agreement ki definition ke saath align kiya gaya hai.\n*   **Permanent Establishment (PE) Scope Expansion:** 'Permanent Establishment' ke scope ko 'Service PE' add karke expand kiya gaya hai.\n*   **Information Exchange & Collection:** Provisions on Exchange of Information ko update kiya gaya hai aur Assistance in Collection of Taxes par ek naya Article introduce kiya gaya hai, jo international standards ke مطابق hai.\n*   **BEPS MLI Incorporation:** Amending Protocol mein BEPS Multilateral Instrument (MLI) ke applicable provisions ko bhi incorporate kiya gaya hai.\n\nYeh Amending Protocol Mr. Ravi Agrawal, Chairperson, CBDT, aur Mr. Thierry Mathou, Ambassador of France to India ne sign kiya tha. Iske changes tab effective honge jab dono countries apni internal legal procedures complete kar lenge.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://pib.gov.in/PressReleasePage.aspx?PRID=2008898)\n\n*Published on: 24 February 2026*",
  "type": "update"
}