{
  "id": "important-update-ifsca-notifies-net-worth-certificate-format-gap-audit-checklist-1771071989856",
  "title": "Important Update: IFSCA Notifies Net Worth Certificate Format & GAP Audit Checklist",
  "slug": "important-update-ifsca-notifies-net-worth-certificate-format-gap-audit-checklist",
  "date": "14 February 2026",
  "content": "# Important Update: IFSCA Notifies Net Worth Certificate Format & GAP Audit Checklist\n\nEk important update hai for entities operating in the IFSC! The International Financial Services Centres Authority (IFSCA) ne Global Access Providers (GAPs) aur broker dealers ke liye Net Worth Certificate ka format aur GAP Audit ke liye ek indicative checklist announce kiya hai.\n\nHere’s a quick rundown of the key details:\n\n*   **Circular Reference:** This update comes via Circular eF.No. IFSCA-DSI/12/2025-Capital Markets.\n*   **Date of Issuance:** The circular is dated February 12, 2026.\n*   **Applicability:** It applies to all Broker Dealers, Recognised Stock Exchanges, and Global Access Providers (GAPs) operating in the International Financial Services Centre (IFSC).\n*   **Net Worth Certificate:** The circular prescribes a specific format for the Net Worth Certificate. This certificate must be submitted on a yearly basis, certified by an independent member of the Institute of Chartered Accountants of India (ICAI). The deadline for submission to IFSCA via email (cmi-supervision@ifsca.gov.in) is September 30th for the preceding financial year.\n*   **GAP Audit Checklist:** GAPs and Introducing Brokers (IBs) are required to get their Global Access activities audited annually. The circular provides an indicative checklist (in Annexure II) for conducting this audit. The audit must be carried out by a peer-reviewed member of ICAI, the Institute of Company Secretaries of India (ICSI), or the Institute of Cost Accountants of India (ICMAI).\n*   **Legal Basis:** This circular has been issued under the powers conferred by Sections 12 and 13 of the IFSCA Act, 2019, read with Regulations 27 and 45 of the IFSCA (Capital Market Intermediaries) Regulations, 2025.\n\nThis move by IFSCA aims to ensure greater transparency, financial discipline, and robust compliance within the IFSC ecosystem.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://ifsca.gov.in/Circular)\n\n*Published on: 14 February 2026*",
  "type": "update"
}