{
  "id": "important-update-gstn-advisory-on-interest-collection-and-gstr3b-enhancements-advisory-no-647-1769821510389",
  "title": "Important Update: GSTN Advisory on Interest Collection and GSTR-3B Enhancements (Advisory No. 647)",
  "slug": "important-update-gstn-advisory-on-interest-collection-and-gstr3b-enhancements-advisory-no-647",
  "date": "31 January 2026",
  "content": "# Important Update: GSTN Advisory on Interest Collection and GSTR-3B Enhancements (Advisory No. 647)\n\nEk important update hai! Government ne **GSTN Advisory No. 647 dated January 30, 2026**, ke through GSTR-3B mein interest calculation aur related enhancements announce kiye hain. Yeh changes January 2026 tax period se लागू होंगे, jisse compliance aur bhi streamline hogi.\n\nHere are the key points from the advisory:\n\n*   **Revised Interest Calculation (Table 5.1 of GSTR-3B):** January 2026 tax period se, GSTR-3B ke Table 5.1 mein interest calculation ka tareeka badal gaya hai. Ab, interest calculate karte waqt Electronic Cash Ledger (ECL) mein available minimum cash balance ka benefit milega, jo Rule 88B(1) of the CGST Rules, 2017 ke proviso ke according hai.\n*   **Applicability:** Yeh naya interest computation un delayed returns par apply hoga jo January 2026 tax period ke liye file ki jaayengi. Iska interest February 2026 ke GSTR-3B mein auto-populate hoga.\n*   **Non-Editable Downwards:** GSTR-3B ke Table 5.1 mein jo interest auto-populate hoga, woh downwards editable nahi hoga. Yaani, aap uss amount ko kam nahi kar payenge. However, taxpayers apni correct interest liability self-assess karke, agar zaroorat ho toh, auto-populated values ko upward amend kar sakte hain.\n*   **Auto-Population of Tax Liability Breakup:** GSTR-3B mein 'tax liability breakup table' bhi auto-populate hoga. Ismein pichle tax periods ki supplies capture hongi jo current period mein report ki ja rahi hain.\n\nYeh enhancements Section 50 of the CGST Act, 2017 aur Rule 88B of the CGST Rules, 2017 ke saath portal functionality ko align karne aur taxpayers ke liye interest calculation ko aur fairer banane ke liye kiye gaye hain.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://tutorial.gst.gov.in/downloads/news/advisory_on_interest_calculator.pdf)\n\n*Published on: 31 January 2026*",
  "type": "update"
}