{
  "id": "mca-issues-advisory-warning-against-fake-circular-on-annual-filing-due-date-extension-1766838173452",
  "title": "MCA Issues Advisory Warning Against Fake Circular on Annual Filing Due Date Extension",
  "slug": "mca-issues-advisory-warning-against-fake-circular-on-annual-filing-due-date-extension",
  "date": "27 December 2025",
  "content": "# MCA Issues Advisory Warning Against Fake Circular on Annual Filing Due Date Extension\n\nEk important update hai! Ministry of Corporate Affairs (MCA) ne **December 26, 2025** ko ek advisory jaari karke stakeholders ko ek fake circular ke baare mein warn kiya hai, jo annual filing due date extension se related hai.\n\nYeh update aapke liye important hai, toh please dhyaan se padhein:\n\n*   **Fake Circular Alert:** Ek General Circular No. 08/2025 dated December 26, 2025, circulate ho raha hai jo falsely claim kar raha hai ki financial statements aur annual returns file karne ki due dates extend ho gayi hain aur additional fees mein relaxation mili hai.\n*   **MCA ki Official Stance:** MCA ne clearly confirm kiya hai ki unhone aisi koi nayi circular issue nahi ki hai. Yeh circular fake aur misleading hai.\n*   **Existing Extension (Genuine):** Doston, confusion avoid karein. Yaad rahe, MCA ne pehle General Circular No. 06/2025 dated October 17, 2025, ke through Financial Year 2024-25 ke annual filings (Forms AOC-4 series aur MGT-7/MGT-7A) ke liye **31st December, 2025** tak additional fees ke bina file karne ki permission di thi.\n*   **AGM Due Dates Unchanged:** Important baat yeh hai ki yeh genuine extension bhi Annual General Meetings (AGM) hold karne ki statutory timelines ko extend nahi karta hai. AGMs ko Companies Act, 2013 ke according prescribed timeline mein hi conduct karna zaroori hai.\n*   **Rely on Official Sources Only:** Aap sabhi stakeholders se request hai ki authentic aur updated information ke liye sirf MCA ki official website, mca.gov.in, par hi rely karein aur kisi bhi unofficial ya misleading communication par vishwas na karein.\n\nApni compliances timely aur correctly puri karein, aur fake news se bachein.\n\n## Read the Official Document\n*   [Visit the Ministry of Corporate Affairs (MCA) Website for Official Communications](https://www.mca.gov.in) (Please check the 'Latest News' or 'Announcements' section for the advisory.)\n\n*Published on: 27 December 2025*",
  "type": "update"
}