{
  "id": "mca-imposes-penalties-for-incorrect-eform-filing-even-if-later-rectified-1768738965646",
  "title": "MCA Imposes Penalties for Incorrect E-Form Filing, Even If Later Rectified!",
  "slug": "mca-imposes-penalties-for-incorrect-eform-filing-even-if-later-rectified",
  "date": "18 January 2026",
  "content": "# MCA Imposes Penalties for Incorrect E-Form Filing, Even If Later Rectified!\n\nEk important update hai for all companies and professionals! Ministry of Corporate Affairs (MCA) ne haal hi mein kuch adjudication orders pass kiye hain, jismein yeh clear kiya gaya hai ki agar e-forms mein galat information file ki gayi thi, toh uske liye penalty lagegi, bhale hi baad mein us error ko rectify kar diya gaya ho.\n\nThese orders, passed by the Registrar of Companies (ROC), Kolkata, on January 16, 2026, underline the importance of accuracy in statutory filings from the very beginning.\n\nHere are the key takeaways:\n\n*   **Core Principle:** MCA considers statutory filings on its portal as public records. Therefore, the responsibility for ensuring their correctness lies squarely with the authorized signatory.\n*   **Rectification is Not a Waiver:** Even if the company admits the error as inadvertent and subsequently rectifies the e-form or requests it to be marked as defective, the Adjudicating Officer has held that such rectification does not nullify the contravention already committed.\n*   **Penal Provisions Invoked:** Penalties have been imposed under Section 454 read with Section 450 of the Companies Act, 2013, for violations including incorrect particulars in Form AOC-4 (e.g., wrong company status, AGM date, financial figures) and Form MGT-7 (e.g., erroneous shareholding disclosure).\n*   **Typical Penalty:** In several instances, a penalty of ₹10,000 each has been imposed on both the company and the signatory officer in default.\n*   **Legal Basis:** The orders emphasize Rule 8(3) of the Companies (Registration Offices and Fees) Rules, 2014, which mandates the correctness of e-forms and attachments.\n\nThis development reinforces MCA's stringent stance on compliance and the accuracy of data submitted through its portal. Companies must ensure due diligence before filing any e-form to avoid penalties.\n\n## Read the Official Document\n\n*   [Download the Official Notification/Circular here](https://www.mca.gov.in/)\n\n*Published on: 18 January 2026*",
  "type": "update"
}