{
  "id": "mca-expands-regional-directors-list-under-companies-act-from-february-16-2026-1771158479737",
  "title": "MCA Expands Regional Directors List under Companies Act from February 16, 2026",
  "slug": "mca-expands-regional-directors-list-under-companies-act-from-february-16-2026",
  "date": "15 February 2026",
  "content": "# MCA Expands Regional Directors List under Companies Act from February 16, 2026\n\nEk important update hai! Government ne Companies Act ke तहत Regional Directors (RDs) ki list expand karne ka announcement kiya hai. This move aims to strengthen administrative oversight and improve accessibility.\n\nHere are the key details:\n\n*   **Notification Details:** The Ministry of Corporate Affairs (MCA) has issued Notification S.O. 699(E) dated February 10, 2026, amending earlier notifications regarding the powers and locations of Regional Directors.\n*   **Effective Date:** This expansion comes into effect from **February 16, 2026**.\n*   **What's New:** The previous list of Regional Directors' offices has been revised and expanded. Earlier, Regional Directors were located at places like Mumbai, Kolkata, Chennai, Noida, Ahmedabad, Hyderabad, and Shillong. This has now been substituted with an expanded list, and Regional Directors will now be positioned at:\n    *   Ahmedabad\n    *   Bangalore\n    *   Chandigarh\n    *   Chennai\n    *   Guwahati\n    *   Hyderabad\n    *   Kolkata\n    *   Mumbai\n    *   Navi Mumbai\n    *   New Delhi\n*   **Objective:** The expansion of Regional Directors' offices is intended to strengthen administrative oversight under the Companies Act, enhance accessibility for companies and professionals, distribute workload more efficiently across regions, and improve responsiveness in approvals, adjudication, and compliance matters.\n\nThis is a significant step towards reinforcing regional governance and improving regulatory efficiency across India for corporate affairs.\n\n## Read the Official Document\n*   [Visit the Ministry of Corporate Affairs (MCA) website for official notifications](https://www.mca.gov.in/)\n\n*Published on: 15 February 2026*",
  "type": "update"
}