{
  "id": "rbi-invites-public-comments-on-draft-amendments-for-net-open-position-1768525210574",
  "title": "RBI Invites Public Comments on Draft Amendments for Net Open Position",
  "slug": "rbi-invites-public-comments-on-draft-amendments-for-net-open-position",
  "date": "16 January 2026",
  "content": "# RBI Invites Public Comments on Draft Amendments for Net Open Position\n\nEk important update hai! The Reserve Bank of India (RBI) ne recently **Draft Amendment Directions on Net Open Position (NOP) – Revised Instructions** ke liye public comments invite kiye hain. This is a significant move aiming to enhance the framework for foreign exchange risk management across various Regulated Entities (REs) in India.\n\nHere’s a quick overview of what this means:\n\n*   **What's New?** RBI ne Net Open Position (NOP) ke calculation aur foreign exchange risk par capital charge ke liye existing guidelines ko revise karne ka draft release kiya hai.\n*   **Why the Change?** The main objective is to align domestic prudential norms with international Basel Committee on Banking Supervision (BCBS) standards and ensure consistent implementation across all regulated entities.\n*   **Key Proposals:**\n    *   The draft proposes to do away with separate offshore/onshore NOP calculations, leading to a unified measurement.\n    *   It includes accumulated surplus of overseas operations in NOP calculation.\n    *   Maintenance of foreign exchange risk capital charge on the actual NOP will be mandated.\n    *   The \"Shorthand method\" for NOP calculation has been modified to treat open positions in gold separately.\n    *   There's also a provision to exempt certain structural foreign exchange positions from NOP under specified conditions.\n*   **Existing Guidelines:** The amendments modify instructions covered under the Master Direction - Risk Management and Inter-Bank Dealings (FMRD Master Direction No. 1/2016-17) and the Prudential Norms on Capital Adequacy Directions, 2025.\n*   **Effective Date:** These revised directions are proposed to come into effect from **April 1, 2027**.\n*   **Comment Deadline:** Interested parties can submit their comments on this draft until **February 3, 2026**.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.rbi.org.in/)\n\n*Published on: 16 January 2026*",
  "type": "update"
}