{
  "id": "cbic-notifies-new-excise-and-gst-rules-for-tobacco-and-allied-products-effective-february-1-2026-1767356632265",
  "title": "CBIC Notifies New Excise and GST Rules for Tobacco and Allied Products, Effective February 1, 2026",
  "slug": "cbic-notifies-new-excise-and-gst-rules-for-tobacco-and-allied-products-effective-february-1-2026",
  "date": "2 January 2026",
  "content": "# CBIC Notifies New Excise and GST Rules for Tobacco and Allied Products, Effective February 1, 2026\n\nEk important update hai! Government ne tobacco aur allied products ke liye naye Excise aur GST rules announce kiye hain, effective February 1, 2026 se. Iss move ka aim tax evasion ko curb karna aur revenue collection ko strengthen karna hai.\n\nHere's a quick rundown of the key changes:\n\n*   **Excise Duty Reforms:**\n    *   The Central Excise (Amendment) Act, 2025, will come into force, bringing significant changes to the excise framework for specific tobacco products.\n    *   A capacity-based levy system has been reintroduced under Section 3A of the Central Excise Act, 1944, for chewing tobacco, jarda scented tobacco, and gutkha manufactured with packing machines.\n    *   The \"Chewing Tobacco, Jarda Scented Tobacco and Gutkha Packing Machines (Capacity Determination and Collection of Duty) Rules, 2026\" have been notified (Notification No. 05/2025–Central Excise (N.T.), dated December 31, 2025).\n    *   Manufacturers will now be required to install functional CCTV systems covering all packing machine areas and preserve the footage for at least 24 months.\n    *   Additional excise duty rates per packing machine for specified tobacco products have been prescribed (Notification No. 04/2025–Central Excise, dated December 31, 2025).\n\n*   **GST Changes:**\n    *   New GST rates and classifications for tobacco products have been introduced. Biris will now attract 18% GST (9% CGST), while most other tobacco-related products like pan masala, unmanufactured tobacco, cigars, and cigarettes will fall under a higher 40% GST slab (20% CGST).\n    *   A new Rule 31D has been inserted into the CGST Rules, 2017 (Notification No. 20/2025–Central Tax, dated December 31, 2025). This rule introduces a Retail Sale Price (RSP)-based valuation mechanism for specified tobacco and allied products, overriding general valuation rules.\n    *   The GST Compensation Cess on all tobacco products has been reduced to 'Nil' (Notification No. 03/2025–Compensation Cess (Rate), dated December 31, 2025), with the new excise duties and cess taking its place.\n    *   Corresponding amendments have also been notified under the IGST and UTGST Acts.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.cbic.gov.in/)\n\n*Published on: 2 January 2026*",
  "type": "update"
}