{
  "id": "icai-releases-global-networking-guidelines-for-ca-firms-1771590933494",
  "title": "ICAI Releases Global Networking Guidelines for CA Firms",
  "slug": "icai-releases-global-networking-guidelines-for-ca-firms",
  "date": "20 February 2026",
  "content": "# ICAI Releases Global Networking Guidelines for CA Firms\n\nEk important update hai Chartered Accountants fraternity ke liye! The Institute of Chartered Accountants of India (ICAI) ne **ICAI (Global Networking) Guidelines, 2025** announce kiye hain CA firms ke liye. Yeh guidelines official gazette mein February 11, 2026, ko publish hue hain.\n\n**Key Highlights:**\n\n*   **Objective:** In guidelines ka main aim Indian CA firms ko international networks ke saath collaborate karne ke liye ek structured framework provide karna hai, jisse unki global competitiveness aur professional avenues badhein.\n*   **Mandatory Registration:** Ab \"Global Networks\" ko ICAI ke saath compulsory register karna hoga. Ismein Indian CA firms aur overseas entities ke beech ke arrangements shamil hain.\n*   **Regulatory Oversight:** Yeh guidelines foreign networks ki Indian operations ko bhi ICAI ke regulatory jurisdiction ke under laayenge.\n*   **Nodal Officer:** Har Global Network ko ek Nodal Officer designate karna hoga, jo compliance ke liye responsible hoga.\n*   **Compliance and Reporting:** Guidelines ethical compliance, annual reporting (Form DGN), arm's length arrangements, aur ICAI Code of Ethics ke adherence ko mandate karte hain.\n*   **Prohibited Services:** Domestic Entities ko Section 144 of the Companies Act, 2013 ke under specified prohibited services perform karne ki anumati nahi hogi, apne audit clients ke liye.\n\nYeh move undoubtedly Indian CA firms ko global platform par grow karne aur apni capabilities enhance karne mein madad karega.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.abcaus.in/icai-global-networking-guidelines-2025.html)\n\n*Published on: 20 February 2026*",
  "type": "update"
}