{
  "id": "icai-announces-special-examination-for-members-of-foreign-accounting-bodies-1770167254565",
  "title": "ICAI Announces Special Examination for Members of Foreign Accounting Bodies",
  "slug": "icai-announces-special-examination-for-members-of-foreign-accounting-bodies",
  "date": "4 February 2026",
  "content": "# ICAI Announces Special Examination for Members of Foreign Accounting Bodies\n\nEk important update hai for members of foreign accounting bodies with whom ICAI has Mutual Recognition Agreements (MRAs) or Memoranda of Understanding (MoUs)! The Institute of Chartered Accountants of India (ICAI) ne ek Special Examination announce kiya hai.\n\nHere are the key details:\n\n*   **Examination Dates:** The special examination is scheduled to be held from June 15 to June 19, 2026.\n*   **Timing & Reading Time:** Exams will be from 2:00 PM to 5:00 PM (IST) daily, with a 15-minute advance reading time for the question paper.\n*   **Examination Centre:** The examination will be conducted in Noida, Uttar Pradesh, India.\n*   **Application Deadline:** Applications must reach the ICAI Headquarters in New Delhi by February 16, 2026.\n*   **Application Submission:** Forms should be submitted strictly via Speed Post or Registered Post in the prescribed envelope. Private courier services are not allowed.\n*   **Admission Requirement:** Admission to the examination requires prior registration with ICAI and the issuance of a registration letter.\n*   **Examination Fees:** The examination fees are non-refundable and must be paid for each attempt.\n*   **Subjects Covered:** The subjects to be cleared will vary based on the foreign accounting body, covering areas like Indian corporate laws, taxation, auditing, ethics, financial reporting, and information systems. Specific exemptions may be available based on previous curricula.\n\nCandidates are advised to read the official announcement carefully and ensure all instructions are followed while submitting their applications.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.icai.org/announcements/)\n\n*Published on: 4 February 2026*",
  "type": "update"
}