{
  "id": "icsi-advisory-on-mgt7mgt7a-certification-under-mca-v3-portal-1766924560298",
  "title": "ICSI Advisory on MGT-7/MGT-7A Certification under MCA V3 Portal",
  "slug": "icsi-advisory-on-mgt7mgt7a-certification-under-mca-v3-portal",
  "date": "28 December 2025",
  "content": "# ICSI Advisory on MGT-7/MGT-7A Certification under MCA V3 Portal\n\nEk important update hai Company Secretaries ke liye! The Institute of Company Secretaries of India (ICSI) ne recent advisory issue ki hai regarding Form MGT-7/MGT-7A certification under the MCA V3 portal. Yeh advisory December 24, 2025 ko jaari ki gayi hai, keeping in mind the recent changes in the MCA 21 V3 filing process.\n\nHere are the key takeaways from the advisory:\n\n*   **Integration of MGT-8:** Ministry of Corporate Affairs (MCA) ne annual filing forms MCA 21 V3 portal par deploy kar diye hain. Companies (Management and Administration) Amendment Rules, 2025 ke तहत, Form MGT-8 ki certification ab e-Form MGT-7 mein hi ek static field ke roop mein integrate ho gayi hai.\n*   **Qualifying Remarks:** MCA ke FAQs (FAQ No. 37) ke mutabik, agar koi qualifying remarks add karni ho compliance ke baare mein, toh unhe Form MGT-7 ke 'Optional Attachment' field mein attach kiya ja sakta hai, with specific reference to the embedded MGT-8 portion.\n*   **MGT-7A aur Small Companies:** December 1, 2025 se Small Company ki definition revise ho chuki hai. Currently, Form MGT-7A mein Form MGT-8 certification ke liye koi designated field nahi hai.\n*   **ICSI's Recommendation:** Due diligence aur credibility maintain karne ke liye, ICSI ne advise kiya hai ki aap Form MGT-8 ke under compliances ko Peer Reviewed Practice Unit ke letterhead par hi certify karte rahein.\n*   **UDIN Generation:** Institute ki guidelines ke according UDIN generate karein aur use Form MGT-7 aur MGT-7A (jahan applicable ho) ke optional attachment ke roop mein attach karein.\n*   **Interim Measure:** Yeh recommendation tab tak valid hai jab tak MCA is subject par further clarifications ya Rules issue nahi karta.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.icsi.edu/media/webmodules/Advisory_w.r.t._Form_MGT-7_MGT-7A_Certification_under_MCA_V3_Portal.pdf)\n\n*Published on: 28 December 2025*",
  "type": "update"
}