{
  "id": "important-update-cbic-advisory-on-hsns-declaration-filing-procedure-1770727724945",
  "title": "Important Update: CBIC Advisory on HSNS Declaration Filing Procedure",
  "slug": "important-update-cbic-advisory-on-hsns-declaration-filing-procedure",
  "date": "10 February 2026",
  "content": "# Important Update: CBIC Advisory on HSNS Declaration Filing Procedure\n\nEk important update hai HSNS Cess Registered Persons ke liye. Government ne **Advisory No. 04/2026 dated February 09, 2026** announce ki hai, jo HSNS (Health Security & National Security) Cess ke liye HSN Declaration filing procedure ko detail karti hai. Is advisory ka aim hai registered persons ke liye Form HSNS DEC-01 file karne ki prakriya ko clear karna.\n\n### Key Highlights of the Advisory:\n\n*   **Advisory Details:** This is Advisory No. 04/2026, issued on February 09, 2026.\n*   **Purpose:** The advisory outlines a step-by-step procedure for filing the HSNS Declaration in Form HSNS DEC-01.\n*   **Accessing the Portal:** All HSNS Cess related functionalities, including filing declarations, are available on the dedicated portal: www.cbic-gst.gov.in.\n*   **Filing Procedure:**\n    *   Taxpayers need to log in to the HSNS Cess portal.\n    *   Navigate to **Menu > HSNS DECLARATION > HSNS File Declaration**.\n    *   The Form HSNS DEC-01 will appear, where the 'Declaration Type' will be shown as 'Initial Declaration' for the first-time filing.\n    *   Registered persons must fill in their \"Basic Information\" (like HSNS Registration No., Legal Name, Address) and \"Goods Manufactured\" details.\n    *   Provision for uploading up to five supporting documents, each not exceeding 2 MB, is available.\n    *   The declaration must be verified by an Authorized Signatory.\n*   **Viewing Filed Declarations:** After successful submission, the filed declaration can be viewed under **Menu > HSNS DECLARATION > HSNS VIEW DECLARATION**. Here, the 'Unique Machine Registration Number' generated by the system will also be visible.\n\nThis advisory ensures a smooth and clear process for HSNS Cess registered persons to comply with their HSN declaration requirements.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.cbic-gst.gov.in/)\n\n*(You can find Advisory No. 04/2026 dated 09.02.2026 on HSNS Declaration filing Procedure for HSNS Cess Registered person under \"HSNS > HSNS CESS Legislation\" section on the CBIC-GST portal.)*\n\n*Published on: 10 February 2026*",
  "type": "update"
}