{
  "id": "income-tax-department-releases-draft-incometax-rules-2026-and-forms-2026-for-public-feedback-1770514189127",
  "title": "Income Tax Department Releases Draft Income-tax Rules, 2026 and Forms, 2026 for Public Feedback",
  "slug": "income-tax-department-releases-draft-incometax-rules-2026-and-forms-2026-for-public-feedback",
  "date": "8 February 2026",
  "content": "# Income Tax Department Releases Draft Income-tax Rules, 2026 and Forms, 2026 for Public Feedback\n\nHello everyone! Ek important update hai. The Income Tax Department has announced the release of the **Draft Income-tax Rules, 2026 and Draft Income-tax Forms, 2026** for public comments. These drafts were released on Saturday, February 7, 2026.\n\nThese new rules and forms are aligned with the upcoming Income Tax Act, 2025, which is slated to come into force from April 1, 2026, replacing the decades-old Income Tax Act, 1961.\n\nHere are the key highlights of this release:\n\n*   **Purpose:** The primary objective is to simplify compliance and make the tax filing process easier for taxpayers.\n*   **Public Feedback Invited:** Stakeholders and the general public are encouraged to review these draft rules and forms and submit their feedback and suggestions.\n*   **Feedback Deadline:** The draft rules and forms will remain in the public domain for 15 days, with the deadline for submitting feedback set for **February 22, 2026**.\n*   **Simplification:** The overall number of rules has been significantly reduced from 511 to 333, and the number of forms has come down from 399 to 190. This has been achieved by removing redundancies and merging provisions.\n*   **New Form Features:** The proposed Income Tax Return (ITR) forms are redesigned for simplification, featuring standardized common information, automated reconciliation, and prefill capabilities to make filing more intuitive and less error-prone.\n*   **Navigational Tools:** To assist with the transition, the Central Board of Direct Taxes (CBDT) has also released two navigators, which provide a mapping of the old rules and forms to their new draft counterparts.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://incometax.gov.in)\n\n*Published on: 8 February 2026*",
  "type": "update"
}