{
  "id": "mca-relaxes-indemnity-for-government-company-name-removal-1767833992192",
  "title": "MCA Relaxes Indemnity for Government Company Name Removal!",
  "slug": "mca-relaxes-indemnity-for-government-company-name-removal",
  "date": "8 January 2026",
  "content": "# MCA Relaxes Indemnity for Government Company Name Removal!\n\nHello, everyone! Ek important update hai from the Ministry of Corporate Affairs (MCA). Government ne Companies (Removal of Names of Companies from the Register of Companies) Rules, 2016 mein amendments announce kiye hain, jisse Government Companies ke liye name removal process mein indemnity requirement thodi relax ho gayi hai.\n\nYeh amendments, jo December 31, 2025, ke Notification No. G.S.R. 940(E) dwara effective hue hain, specially Government Companies aur unki subsidiaries ko benefit denge.\n\n**Key Changes Kya Hain?**\n\n*   **Pehle kya tha:** Earlier, Section 248 of the Companies Act, 2013 ke तहत strike-off application ke liye, individual directors ko Form STK-3 mein indemnity bond submit karna hota tha, jismein personal responsibility hoti thi.\n*   **Ab kya hai:** As per the amended Rule 4(3), agar company ek Government Company hai (jahan Central ya State Government ne directors appoint kiye hain), toh indemnity bond ab Form STK-3A mein diya ja sakta hai.\n*   **Kaun sign karega:** Yeh bond ab individual directors ki jagah, concerned administrative Ministry ya Department ke authorized representative (not below the rank of Under Secretary or equivalent) dwara execute kiya jayega.\n*   **Why this change:** Is move ka aim hai Government-nominated directors ke liye compliance easy karna aur Government Companies ke strike-off procedure ko streamline karna.\n\nYeh ek welcome move hai jo ease of doing business ko promote karta hai aur procedural hurdles ko kam karta hai, especially for entities jahan directors official capacity mein serve karte hain.\n\n## Read the Official Document\n*   [Download the Official Notification/Circular here](https://www.mca.gov.in/bin/dms/getdocument?mds=4k9X1%252By%252B0qciDmzvy2y53Q%253D%253D&type=open)\n\n*Published on: 8 January 2026*",
  "type": "update"
}